[
  {
    "video_id": "UxD-cbNi4Kc",
    "language": "ja (auto)",
    "full_text": "ここで資料を作ってくださいと指示をする だけで20枚のスライドが一瞬ででき ちゃいました。これ使うと34時間かかる パワポ作りが冗談抜きで10分でできます ね。どうもたむです。今回は Micクrosoft最強のAIツール、 COPロットを使って実務で使える スライド資料を作る具体的な方法を解説し ていきます。最初に聞きたいんですけど皆 さんってスライド資料を手作業で作ったり してませんか?これもし0から主動で作っ てるとしたらほんまにもったいないです。 AIで作るスライドって微妙なものが多い んだよなって思った人はもっともったい ないです。ちゃんとAIを使いこなせる人 であればこんなスライドやこんなスライド が本当にAIでできちゃいます。そこで 今回はパワポイントとの相性が抜群 なコパイロットを使って実際にスライド 資料を0から作る方法を解説していきます 。さらに概要欄1番上にあるLINEでは 現場で使える資料にするため のコパイロットマニュアルも配布している ので是非見てみてくださいね。それで は行きましょう。 それではですね、実際にパワーポイントの 画面を見ながらスライド資料の作り方を 解説していきたいと思います。今回はです ね、一旦車内向けに上司だったりとか、 あとはチームメンバーに対して報告書と いう形で実際のスライドを作る想定で進め てみましょう。実際こう仕事していくと ですね、報告書だったり営業職であれば 社外のクライエントさんに向けて提案資料 を作る場合などあるんじゃないでしょうか 。基本的に今回ご紹介するね、方法で車内 向け、社外向けどちらも対応できますので 実際に見てみてもらえればなと思います。 今回はね、車内向けで報告書を作っていき ましょう。まずパワポイントの画面を見て いただきたいと思うんですが、今回普通に スライドを作るんですけれども、スライ ドって基本的にいきなりデザインに入る わけじゃなくて、骨組となる文章の作成が まず必要ですよね。何をそもそもタイトル に入れるのかとか、あるトピックとして何 を入れるのかっていうデザインの手前に 文章の作成があるかなと思うんですけども 、まずはこれを作っていきます。これも 基本的なデザインだけじゃなくて文章も コパイロットで作っていけますので一緒に 見ていきましょう。1番最初ですね、この パワーポイントの画面に行っていただいて 右上のコパイロットというアイコンと共に 書いてあるかなと思います。これを クリックしてみてください。そうすると さんこんにちはという形でコパイロタから チャットをここで打つことができますね。 ここでチャットをしていく中で文章を作っ たりあるいはスライドのデザインなどを 作れたりすることができますね。これね、 最初開いていただくと以下に関する プレゼンテーションを作成しますとか、 アイデアスライドを追加するとかすに何 から始めるかっていうのも選択できますし 、あとは手打ちでここからメッセージを 直接打つこともできます。一旦ここでね、 メッセージを送ってですね、デザインの 骨組みとなる文章を作っていきましょう。 例えば車内向けに新規事業の報告書を作り たいと下の要素を入れて内容を考えてと 打ってみたいと思います。内容はね、 そんなに細かくなくていいんですけれども 、例えば授業を始めた背景とか今回何を 入れるかていうところです。ここは手打ち で考えていただいて結果とその結果を元に した改善策と今後の進め方と他にもですね 、ライバル市場とかそういうトピックとし て報告すべき内容がすに決まってれば入れ てもいいと思いますし、こういうの入れた 方がいいんじゃないかっていうのがあれば ご自身で入れていただくのがいいのでは ないでしょうか。ということで一旦簡易的 に報告書の内容を3つ決めてテキストで 作ってもらいたいので組みてみたいと思い ます。送るとですね、すぐに実際の報告書 の内容を書いてくれるんですよね。事業 始めた背景ってところが何も指定してない ので、この内容が合ってるか間違ってる かっていうのはちょっと分からないんです が、もし自分で書きたい内容があればこれ について軽い文章でもいいので入れて あげるとそれに即した内容を書いてくれ ます。その結果とか目標とか例えば20% 向上させるとかを10%増加っていうのは 何も数値を反映させてないのでこっぱい ロット顔で一旦作ってくれる形になりまし た。何も言ってないのに勝手に言い回しと して満足度25%上げるとかこの内容 例えば出してもらってそっから自分がこの 内容入れればいいんだっていうところを 反映させていただいてもいいです。もしね 何か入れたい内容があればそれを入れて いただけるといいのではないでしょうか。 ということで一旦ですね、報告書のざっと した概要文章に作れました。で、ここから ですね、実際にデザインにね、年し込み たいと思っていますので、それを作って いきましょう。一旦ここに頂いた内容をね 、左のコピーをクリックします。そうする とコピーがされるので、この内容を元に 入れていきましょう。これね、デザインを 作ってと言ってもいいですし、 パワポイントの真ん中の画面にある左上の ね、ちっちゃなボタンがありますね。これ をクリックすると新しい プレゼンテーションの作成とかファイル からプレゼンテーションを作成するという のがあります。これはね、新しい プレゼンテーションの作成をクリックし ましょう。そうするとイカについての プレゼンテーションを作成しますという ところでここでね、え、また指示を出すん ですが、これは先ほどコパイロットで作っ てもらった文章をそのまま打ち込む形 でオッケーです。プレゼンテーションの デザインっていうところなんですが、今 拍死の状態になっていますね。デザインの 変更。ここをね、クリックしていただくと 新着順とMicクros365の テンプレートを選ぶこともできます。 あるいはですね、車内でデザインの Oマットがこれをやってくださいみたいな ものがね、逆にあれば新着順とかね、 Micクrosのこの中にですね、車内用 のデザインがある場合もあるかなと思い ます。その場合はそちらを選択してみて ください。ない場合は新着順の拍手の状態 でもいいですし、テンプレートがあるので 、もしこれいいなというものがあればそれ を選んでいただいても大丈夫です。今回は 0から作ってみるという解説動画なので、 この状態で作ってみたいと思います。 先ほどですね、以下についての プレゼンテーションを作成しますといった ところで、先ほどコピーしたものをその まま貼り付けていきましょう。上とか下の 方にあるコパイロットの回答みたいな ところがあるので、一旦これを消して開業 などを入れてあげてください。こちらで エンターを押すとプレゼンテーションの トピックを生成してますという形で トピックをですね、内容からこういう内容 がいいんじゃないかみたいなものですね、 選んでくれます。ここには一旦背景そして 目標と結果、改善策と今後の進め方という 大枠はですね、先ほど僕の方で決めたん ですけれども、例えばこの市場調査の概要 とか顧客の分析とかこのトピックに入れた 内容をここに反映させてくれているという のが分かります。これすごいですよね。 目標と結果っていうところも主な目標設定 あるいは初年度の目標数値、そこからの 成果と詳細と分析という形でそれっぽい トピックに3つ分けてくれてますよね。 ここについてスライド数12、スライダ 40って書いてあるんですが、たったこれ だけでスライド12枚ぐらい作れる イメージです。ここに何か入れたいという ものがあれば新しいトピックなどを追加し て、例えばフィードバック内容だったりと か、ご自身の報告書だったら報告書に入れ なければならないなどをここで追加する こともできます。ポパイロットでチャット してる時に入れるの忘れちゃったなという 時はこれら入れていただけるといいんじゃ ないでしょうか。一旦ここはですね、パツ にしてこちらで作ってみたいと思います。 そしたらね、スライドの生成はこちらです 。こちらをクリックしてください。え、 そうするとスライドにタイトル追加します という形でコパイロットが プレゼンテーションのスライド資料を現在 作成してくれています。そうすると スライドがこんな感じで出てきました。 ざっと見ていただいてこんな感じがいいか なというものがあれば下の方にあるこの まま保持というものをチェックしてみて ください。一覧になってるので右下の方に 1枚1枚ちょっと見ていきましょう。はい 。こんな感じで新規事業報告タイトルは何 も考えてなかったのでコパイラトに作って もらってるんでここはね若干手直しが必要 かなとは思いますが実際ざっと見てみると 例えば事業始めた背景というタイトルと共 に市場調査の概要本当にこのスライドっ ぽい感じですよね客ニーズの分析のような 形でざっと内容が書かれてます。開業など ね軽く手直しは人間ではね必要なんです けれども競争力の向上とかオンライン プレゼンスとかビジネス用語なども入れて くれてスライドに落とし込んでくれてい ますね。画像もね、勝手に入れてくれるし 、あとは注み出しと内容みたいな形で 分かりやすくスライドにまとめてくれて ます。いいですよね、これ。めっちゃ こんな形で最初車内向けの新規事業報告書 を作りたい。こんなめちゃめちゃ簡単な 出しからここまで一瞬で作ってくれてい ます。もちろんこれをご自身の内容に 当てはめてここはいらないとかこれはこう いう内容とか書き換えてもらってもいい ですし、そのまま使えそうなものは逆に この内容から報告書の内容を考えるとか そういったものもいいんじゃないでしょう か。さらにですね、作ってくれてはいるん ですが、もうちょっとスライドっぽく作り たいなみたいなのがね、あるかなと思い ます。画像が入っていて、見出しと本分だ けっていうのはこれだけで使えてい るっていうのはちょっと難しそうかな みたいな、そういう思いもあるんじゃない でしょうか。より精度を高めてスライド シ量っぽくしたいなみたいな、そういった ニーズもあるかなと思います。その時には ですね、ま、例えばここをクリックして いただいて上のメニューにあるスマート アートに変換。こちらのね、スマート アートが結構おすめです。クリックすると ね、こんな形で図にしてくれてます。押す だけで普通に使えるテンプレートのような ものがあるので、これを是非使ってみ ましょう。例えばボックスリストを使って みようかなという感じで作ってみます。 押すとですね、ちょっと崩れた形になるの で、ここからですね、え、ちょっと整えて いきましょう。左と右と見出し、本文と 分けたいので、見出しの部分と本文の ところタブキーを押してみると、はい、 こんな形でタイトルがあって右に文章が ある形にできます。これですね。一旦全部 やってみますね。競合分析のこの下競合 他者の強みと編みを評価しっていうところ ですね。選んでタブを押すだけで簡単に 分れてくるので同じように最後やります。 こんな感じでですね。で、左にタイトル、 見出し、そして実際の内容を作ることが できました。ちょっとこれね、大きさとか 例えば大きくしてみるとか開業など入れて あげると読みやすくなりますね。若干開業 がちょっと変なところもあるので開業は ですね、シフトエンターなど押すとできる かなと思います。こんな感じでできました 。スマートアートかなり綺麗な テンプレートとしても使えますし、こんな 感じで左と右に分けるだけでも見栄えが 良くなりましたよね。是非使ってみて ください。これ全体的なお話なんです けれども、何もフォーマットなど指示して ないとなんとなくね、タイトルがあって、 その内容が書いてあるとかはそれっぽい んですけど、左に画像がある場合だったり とか、右に画像がある場合ね、あるいは 見出しが左にあったりとか、右にあったり とか、結構バラバラですね。本来車内報告 書や営業のスライド資料などでもそうだと 思うんですけども、デザインのね、レイ アウトっていうのは全体的に統一性がある 方が小切れですし、見やすさっていうのも ね、全然違うかなと思います。この作って もらったもの悪くはないんですけど、 レイアウトがバラバラで見やすいようで見 にくいなと思う方も多いんじゃない でしょうか。それをね、直す方法というか 、レイアウトを統一した上でコパイロット に作ってもらう方法もご紹介します。それ ではですね、まずはWordをご用意 ください。パワーポイントないだけでもね 、一応できるっちゃできるんですけれども 、Wordを使って連携させてあげた方が レイアウトの統一とかね、あるいはこう 出してくるアウトプットの質が結構安定し ますので、このワードをですね、是非とも 使ってみてください。Wordにですね、 内容を書いていくんですけれども、例えば 先ほどのね、新規事業報告書の内容ですね 、ちょっと見やすくします。こんな形で 授業始めた背景とか目標と結果、改善と 今後の進み方みたいな感じでコパイロット が作ってくれた文章があります。例えば これをですね、一旦全部選んでいただいて 、この左下の方にですね、エコパイロット のちっちゃなボタンがありますので、これ を押してみてください。そうすると プロンプトを書き込みますとか、自動 ライトとかって表として資格とかあります が、プロンプトを書き込みしますという ところをですね、選んでいただくとこの 内容について操作をすることができます。 例えばこの内容を車内報告書向けに内容を 追加してブラッシアップしてというような 市場ですね。はい。一旦出してみましょう 。で、生成をクリックします。はい。そう すると早いですね。授業の背景だったりと かあるいはこんな感じすぐできましたね。 一旦ですね、これを置き換えしたいので 置き換えをクリックします。そうすると このWordだけでもですね、新規事業 報告書という形で背景あるいは目標達成 及び状況とか主な取り組み内容とかですね 、フラッシュアップしてくれました。で、 課題と改善策今後の展望結構なんか それっぽいですよね。これだけで めちゃめちゃ使いやすいのかなと思います 。じゃあ、一旦この資料ができましたので 、これをデザインに落とし込んでいく方法 に移っていきましょう。このWordの ですね、この右上の共有ってところを クリックしていただいて、まずは一旦保存 をします。これですね、ワンドライブに 保存しないとパワポイントで作る時にです ね、この内容をですね、引き継げないので これをワンドライブに保存してください。 例えば一旦文章のこのままを保存していき ます。そうするとワンドライブの方に アップロードもできて保存もできましたと 。もう1回ですね、共有をしていただいて このリンクをコピーで表示と編集。こちら ですね、リンクを読み込んでます。ていう 形でコピーができました。それではね、 またパワポイントに戻っていただいて真っ ています。一旦ここでレイアウトの固定化 という作業をします。パワポイントの メニューバーにある表示というところの スライドマスターっていうところを クリックしてください。そうするとね、 このスライドマスターのところでスライド のレイアウトを固定することができます。 こういう形でね、作るとか初期では様々な レイアウトがね、入ってるんですが、これ を一旦全部消してください。時押せば全部 消えます。そしてこの1番上にある書式が 1番メジャーな形なので一旦これで作って みたいと思います。この上にねタイトルが あって中に本文があるとオードの形ですね 。まずここをですね、一旦cロAを押して コピーをします。そして下にあるところ これに書き換えます。一旦cロAで削除し て真っ白にしてCtrlVで先ほどの形が コピーできました。もうちょっとデザイン をね固定化させてみたいと思います。 例えば挿入ってところの付計でこここんな 形で枠を囲ってみたいみたいな形で作って みましょう。枠を作成したら一旦これを 再面へ移動させてこれを例えばタイトル などとして入れていきます。例えばこれを ですね、真ん中にタイトルを入れて太字に したりとかあるいは文字の色を白にしてみ たりという形でこれで固定化させますと いう感じです。一旦これもですね、え、 テキストなどと入れていただけたらこんな 形でタイトルが真ん中、白文字、そして テキストがこの中という形で固定すること ができます。そしたらスライドマスターの メニューバーにある閉じるをクリックして ください。え、そうすると1枚目はね、 このような形になってるので、ま、一旦 新規作成して1枚目ちょっと削除しちゃい ます。そしたらこのような形でね、新しく 作成しても固定化することができました。 この状態でですね、え、コパイロットに スライドを依頼してみましょう。そしたら この右上の先ほどもやったよう にコパイロットのアイコンをクリックして ください。はい。そうするとコパイロット でチャットができるようになりますので、 こちらでですね、イカのドキュメントを元 にスライド資料を作ってくださいと指示し ます。そしてここにですね、URLを入れ ます。このような形でURLを入れました 。このURLはですね、先ほどWordの 右上のね、共有からコピーしたリンクに なります。これだけでできてしまうので、 これでね、一旦指示してみます。はい。 そうすると応答処理中ってところでこれで サイレドをまずファイルの中身を見て そしてプレゼンのアウトラインを今作って くれています。すごいですよね。はい。 内容もね、え、実際勝手に読み取ってはい 。もうできましたね。早めですね。これ ノーカットです。ノーカットでも10秒 ぐらいできましたね。本当にこのような形 でですね、作ってくれた中身を実際 ちょっと見ていきましょう。中身を見ると 過剰書きのものが多いかなと思います。 これはね、実際にドキュメトの内容がそう だったものなので、一旦ね、過剰書きの ものが多いかとは思いますが、たまにね、 え、このような画像とかも入れてくれたり してますね。例えばこの20%向上試合や 拡大、10%拡大、これをまた見出し、 そして文章のような形になってるので、 これをですね、見やすくしたいと思います 。これをですね、クリックして選択をして いただいて、先ほどと同じスマートアート に変換。これですね。これをね、例えば 入れてみます。そうすると先ほどと同じ ような形になるので、この矢印をクリック していただいて、で、この文章のところを ですね、タブでこんな形でちょんちょん ちょんとね、タブでやるとこんな感じで ですね、初度の目標。これだとね、上の このデザインと下の本文のデザインが統立 されてるんで、めちゃくちゃ見やすいです よね。顧客満足度の20%向上とか、シア 、あの、拡大10%増加とか、で、新規 顧客選権達成とかで結構分かりやすく目標 。何に対してのトピックがあって、それに 対しの数値がどれだけか10%増加とか 先権達成とか分かりやすく目標にもなる ような形ですね。結構このスマートアート が実際にね、こうパイロットを使って骨組 というかデザインのレイアウトを作って くれてるのでその上でですね、この スマートワートを使いこなしてあげると すごく見やすいデザインだし、統一性も あるし、普通にね、デザインとして車内 向けの報告書あるいは社外向けの提案資料 などに普通に使うことができます。これ めちゃくちゃいいですね。今回紹介した 機能はですね、コパイロットで作るとか 実際にこのプレゼンテーションの作成とか ですね。基本的にはMicクrosoft 365のプロに入っていればできるんです けれども、Micクrosoft365に もですね、細かくプランが分かれていたり とか、あるいは企業向け、個人向けの プランでですね、使用が若干異なってる 場合があります。あるいは環境とかですね 、Windowsのパソコンなのか、 Macのパソコンなのかとかですね、 アプリなのか、Webなのかみたいな ところで若干コパイロットでの機能が マイナーチェンジとかこっちは使える けれども、こっちは使えないみたいなこと がたまにあります。あるいはなんか アップデートでですね、できなくなっ ちゃうとかできるようになったとかですね 、細かな仕様の変更があるので、そこはご 注意ください。もしできない場合はですね 、例えばWEで使ってみてできなければ アプリで使ってみるとか、あるいはアプリ で使えなかったらWebでやってみるとか ですね、ちょっと環境を変えてチャレンジ してみてください。コパイロットで スライド作成はめちゃくちゃ効率化できる んですけど、実際はプロンプトをちゃんと 組み込めばもっとクオリティ高いスライド も作れちゃいます。要はコパイロットの 指示出しがうまければ出力される クオリティもちゃんと高くなるんです。 AIじゃなくて人に頼む場面を想像してみ て欲しいんですが、資料いい感じに作っ といてっていうよりもこの資料この フォーマットで500時ぐらいで作ってて より具体的に頼む方が自分の求めてる資料 ができそうじゃないですか?AIも同じで 指示出しがうまければいいものが作れるん です。逆にAIはまだ実務では微妙とか 言ってる人ほど指示出しが下手だったり するんですよね。こういう指示出し。AI で言うところのプロンプトは今後普遍的に 使えるスキルになりますし、このスキル さえ身につけておけばチャットGPTとか クロードなど他のAIツールも 使いこなせるようになるんですよね。 そして近い将来ある程度のプロンプト スキルを持ってるのが当たり前の時代に なります。ただ今が1番暑い時期である 程度プロンプトもテンプレ化されてきた今 がプロンプトを学ぶタイミング的に1番 いいんですよね。逆に今逃したらあっと いう間に置いていかれますし、それくらい AIはスピードが早いんです。僕の公式 LINEでもプロンプトや最新AIに 関する勉強会を開催してるので、置いて 行かれたくない人は追加して是非勉強会に 参加してみてください。それではまた次の 動画でお会いしましょう。さよなら。",
    "word_count": 9426,
    "duration_seconds": 1113.2,
    "fetched_at": "2025-12-12T01:03:41.065653",
    "title": "Copilotでスライド資料作成"
  },
  {
    "video_id": "A74NTehMnyE",
    "language": "ja (auto)",
    "full_text": "どうもこんにちは。今日の動画では業務の 新捗を参照して率直なフィードバックを 送ってくれるAI上司を作っていこうと 思います。人間の上司だと仕事も忙しかっ たりお互い気を使ったりして適切な フィードバックをもらえない環境にある ことが多く想定されると思いますが、AI 上司を作ればいつでも適切な フィードバックをきちんと数字に基づいて 送ってくれるようになります。今回は例と して私がやっているYouTubeの データを分析させるっていう仕組みを構築 していこうと思うんですけれども、データ を入れ替えればどんな業務にも使えるかな という風に思いますので、是非やってみて ください。それでは行ってみましょう。 まず今回作るものの概要を説明します。 まずオブジアンで作ったマークダウン ファイルをカーソルで開きます。次に マークダウン形式で記述しているロンプ テンプレートをカーソルで実行します。 するとこのように分析を始めてくれます。 単照にしている情報としてはマークダウン 形式で表として技術している YouTubeの進捗表そして動画ごとの 成果になります。そして完成した フィードバックのデータが否定した ファイルに入るそういうローになってい ます。このように自分が定期的に実行する フィードバックこれをプロンプトの テンプレートにして実行するそういう 仕組みを作っていきたいなという風に思い ます。今回使うものはオブジディアンと カーソルになります。主にはカーソルに なるんですけれども、オブジリアンで管理 するとマークダウン形式でノートを作る ことができ、自分で作ったノートをAIに 参照させたり、AIで新しい資料を作っ たり、色々な発展的な使い方ができるので オブジアを使っていこうかなという風に 思います。まずオブジディアンを ダウンロードしていきます。 オブジディアンと検索して1番上に出て くるページにアクセスをします。すると このように出てくるのでこのボタンを押し てダウンロードをしていきます 。ここの言語を日本語にすると表示が日本 語になり分かりやすくなります。まず 保管庫新規作成をクリック。保管庫の名称 を作っていきます。今回はYouTube テストとします。ロケーションはファイル の場所になるので自分がOBGのファイル を保存したい場所を指定していきます。 そして作成をします。するとこのように OBDのノートを作成していくことができ ます。今回はここに色々なフォルダー ファイルを作っていきます。まず テンプレートを入れるためのフォルダー テンプレートを作ります。そして現在の 進捗や動画の評価などを入れる プロジェクトページを作ります。そして もう1個フォルダーを作り、こちらに フィードバックを入れるための YouTubeフィードバックを作成し ます。今回はYouTubePJTの中に 入れてしまいます。ここで少し余談なん ですけれども、オブジリアンのノート作成 のコツみたいな記事がたくさんあるんです けれども、最初はあまり気にしない方が いいかなという風に思います。ファイルの 場所を決めて特に考えずそん中にたくさん のノートをとりあえず作ってみるというの をお勧めします。とは言ってもオブジアを 使いこなすために必要な知識が何個かある のでここで簡単に紹介しようかなという風 に思います。まずオブジアントはローカル にノートを作っていくノートエディターに なっています。なのでクラウドに保存する ノとは違いここで作成したオブジリアンの ノートはローカルに保存されていきます。 ローカルに保存されているのでカーソルで 容易に開くことができるということになり ます。2つ目はマークダウン形式で記述を していくというところです。どういうこと かと言うと、見出しや過剰書き、番号付き の過剰書き、太字の書き方など マークダウンというものに則って記載をし ていくということになります。 マークダウン形式で記述されたものをより 見やすくするのがオブジアなので、目で 見るとWordやGoogle ドokキュメントなどで作ったノートと ほぼ同じような挙動をするのですが、実際 に記述されているのはテキストデータに なります。なのでAIが余分な情報なく これは見出し、これはひ分、これは過剰 書きなどを判定しながら見ていけるという ものになります。これがAIと マークダウン形式の相性が非常にいいと 言われる理由です。次にノードとノートを つぐことができる。これがオブジアンの 最も強いメリットになります。どういう ことかと言うと、例えばこの YouTubeテストというページを ウェルカンページとつげたい場合にはこの 括を二重で作ることによって先ほど作った YouTubeテストこれをクリックする とこのようにウェルカムページの中に YouTubeテストというノートを つげることができます。これをクリック することによってすぐにYouTube テストに飛ぶことができます 。以上がオブジアのダウンロード セットアップ方法とオブジアンでノードを 取っていくことのコツになります。次に カーソルをダウンロードしていきます。 カーソルと検索をし1番上のページを クリックします。するとこのようなページ に行くのでダウンロードログインをして いきます。試すだけであればプロ版の2 週間トライアルが無料についているので これを利用して試してみて実際に使える ようであれば継続して課金をしていくこと をお勧めします。カーソルはコード エディターなんですけれども文字を使った 資料作成にかなりの革命を起こすことが できるのでエンジニアじゃない方にも是非 とも使っていただきたいツールになります 。ダウンロードできたらカーソルを開いて 先ほど作ったオブジディアンのノートを 開いていきます。先ほど作ったのはこの YouTubeテストというフォルダーな のでこれを開いていきます。こちらに 先ほど作ったYouTubeテストや ウェルカンページ、それとテンプレート、 YouTubePJTといったような フォルダーが表示されています。以上で 初期設定のセットアップは完了です。ここ にフィードバックを自動でするための 仕組みを構築していきます 。まずオブジリアにてプロンプを作成して いきます。新規ノートを追加。名前を YouTubeプロジェクトプロンプト テンプレート。このように設定します。 そしてこの中にプロンプトを記述していき ます。プロンプトの書きのコツとしては まず役割を与えてあげる。このような挙動 をして欲しいというような役割を与えて あげます。そしてその次に前提。これは プロジェクトの前提になっています。今回 は私のYouTubeチャンネルの前提を ここに記載していきます。そして チャンネル情報を与えます。続いて進捗と いう項目を作っていきます。ここでLLM に対して今の現状のYouTubeの進捗 。これをデータで渡していきます。これは 後で設定します。そして最後に実行フロー という項目をつけます。これはLMの エージェント、特にパーソルの エージェントにこのように挙動して欲しい というような指示を送る部分になります。 まず進捗。この上の進捗を確認して現在の 成績を分析。フィードバックを送る前に 必要な情報があれば確認をすること。上気 の情報を踏まえて率直なフィードバックを 行うこと。終わったら次に向けての ネクストアクションの方向性の提示をする こと。そして視認性よくまとめてファイル を新たに作り、そのファイルを指定した ディレクトルに入れて欲しいというように 指示します。今回はこのYouTube フィードバックのページを指示しています 。プロンプトテンプレートはテンプレート の部分に入れておきましょう。続いて進捗 に該当するYouTubePJTの進捗表 を作っていきます。新しくファイルを作り ます。この中に進捗表を作っていきます。 今回はこのような項目で表を作っていき ました。そしてもう1つページを作ります 。今回はYouTubeの管理者ページ からダウンロードした動画ごとの評価、 動画ごとのデータについてこれを表記式に まとめてLLMの方に入れていきます。 これをすることによって動画それぞれの 再生回数などがLLM側に渡って、より 適切なフィードバックができるんじゃない かなという風に考えました。この2つの フォルダーはYouTubeプロジェクト の中に入れていきます。プロンプト テンプレートの方に戻ります。そしてこの 進捗の部分を記述していこうかなという風 に思います。 マークダウンで過剰書きをやる場合には分 スペースで過剰書きをするこができます。進捗に関してはと打った中で 2 [音楽] 重にこして進捗表を選択ダウンの内容を参照してほしいこのように記述をします。続いて動画ごとのに関してはい述をしく 20重ほどの動画ごとのという風に作ったダウンのページを示します。そしてこの捗の部分をもう少し補強していきます。これで完成しました。 [音楽] またカーソルに戻ります。カーソルについ て簡単に説明をします。左、1番左が ディレクトリーになります。これは ローカルに保存されてあるファイル構造が 見て取れるかと思います。真ん中がその ドキュメントになります。記述されてある 内容がそのまんまひら分で表示されている かなという風に思います。右側がLLMの 領域になります。もしこれが表示されて ない場合はこのトグルAIページという 部分から切り替えを行うことができます。 この部分を使うことによってチャATGP のようにAIと会話をしていくことができ ます。またここにエージェント、アスク、 マニュアルとあるんですけれども、今回 やる動作の時にはエージェントという風に 打ちます。私はLLMのモデルを固定して いますが、ここはオートセレクトでも問題 ないです。カーソルに戻ったらまず テンプレートを開きます。そしてカーソル 上でアットマークでファイルフォルダーが 選択できるようになるのでプロンプト テンプレート、これを選択。これを実行し て欲しいという風にプロンプトを打ちます 。それではやってみましょう。このように 2つのマークダウンのファイルを読んで 現在の状況を分析しています。ファイル パスに謝りがあった場合には検索すること によって探してくれます。これがAI エージェントのすごいところかなという風 に思います。そして現状を分析し フィードバックを行いストアクションの 提案をしてくれています。そして最後に 完成されたファイルっていうのものがこの YouTubePJTフィードバック。 ここに入っていくというようになります。 このようにファイルが記述されました。 カーソルで記述したファイルというものは オブジアンの中でも開くことができます。 確認をしてみましょう。現状の フィードバック、ネクストアクション提案 。この内容がまとまっています。いかが だったでしょうか?今回はすごく簡単に テンプレートと簡単な表記式を渡すことに よってフィードバックを行うAI エージェント上司を作ってみました。この 他にも与える情報や情報の与え方によって もっと広い情報を拾ってきたり、もっと 意味のあるフィードバックをしたり、 さらにそのフィードバックのネクスト アクションを整理していったり、そういう ようなことができるかなという風に思い ます。こんな感じでAIツールにとことん 触れることによって自分の可能性を広げて いくそんな発信をしていこうかなという風 に思いますので、この動画がもし良かった と思っていただけたら高評価とチャンネル 登録のほどよろしくお願いします。それで はまた次回の動画でお会いしましょう。പ",
    "word_count": 4943,
    "duration_seconds": 581.04,
    "fetched_at": "2025-12-12T01:03:41.901666",
    "title": "AIエージェント構築"
  },
  {
    "video_id": "Y5gsr8ynves",
    "language": "ja (auto)",
    "full_text": "できました。見くられてみても めちゃくちゃ少ないすか。本当に雰囲気に 似てますよね。いや、今回の再遠度は やばくないですか?しかも全部編集可能 ですね。はい。もうくじもね、ほとんど 同じというかむしろなんか綺麗になって ますね。で、こうやったビジュアライズも 完全に再現してくれてます。しかも今回ね 、こういった部分も全部編集可能になり まし[音楽]た。やばくないですかこれ。 はい。え、どうも皆さんこんにちは。もう 12月差しかかりましたね。というわけで 今回はAIを使ってスライド生成する方法 っていうのを私が超緊張してきた中 [音楽]で1番クオリティが高くて1番 実用的なそういったスライド生成の手順 っていうのを紹介したいなと思います。 この動画を見ればですね、現状1番 クオリティが高いスライド生成の方法を解 することができます。はい、というわけで ねバナナに軽くスローをまとめてもらい [音楽]ました。簡単に説明しますと こちらですね。自分が参考にしたい クオリティのスライドです[音楽]ね。 レイアウトだったりトンマナだったり フォント何でもいいんですけど、そういっ たものの参考になるスライドっていうもの をまずね、用意します。もしPDFだった としてもPNGに変換したりするだけで いいので、こちらのテージもね、後ほど 紹介します。そしてその後ですね、その スライド画像だったりを元に今回作成し たいスライドの相案だったりストーリー ラインみたい[音楽]な部分を生成使して いくという風になります。こちらGPTを 使ってそのどういうメッセージを送るか だったり、どういうビジュアライズをする かっていう部分もAIで整理してもらい ます。で、その内容を元に今回ですね、 ノートやレの資料生成という新しい機能を 使って、その内容を再現[音楽]したい クオリティをもに味想のね、資料スライド の画像っていうのを作ってもいいます。で 、今回以前の動画と大きく変わるのがこの クロドですね。かなり進化したのでこの 手順だったりっていうものをね、今回 [音楽]新しく紹介させてもらえればなと 思います。Googleスライドも パワポイントも両方の形式でね、対応し てるので、それで最後のね、スライドまで 完成っていうのを1通過して回っていき ます。それではね、軽く流れを紹介したの でこの後は実際に行きたいと思います。 はい、というわけでこちらですね、軽い [音楽]私の自己紹介になります。ただ ですね、市場調査からプロダクトアートの ね、マーケティングそして広告運用から クリエイティブの作成に至るまで自社でね 、位置通っております。領域としても金融 から有大な部分に至るまで幅広く展開して おります。その中にもですね、法人さん 向けに試合もさせていただいております。 こちらのコンサルティングや雲みたいな ことで入ることもあれば、[音楽]車内 研修あるいは業務効率化ワークフローの 構築みたいな部分まで出けております。 このチャンネルを見ればですね、生活用について間違いなくトップレベルの知識だったり、本当に実用的なの活用術っていうのを学べると思っております。ただ詰まったら皆さんは是非チャンネル登録をして、え、そして実践で使ってもらえるというかなと思います。あ、 [音楽] はい。それではですね、早速スライドを生成していきましょう。まずですね、参考にしたいだったりクオリティを制限したいスライドっていうのを用意してもらいます。ま、私の場合ですね、動画でよく使うこちらのサイトのこのプレートを用意させてもらいます。 で、こっちがですね、こちらPDFじゃ なくて画像ですねの形用意するのが本当に 固定になります。はい。なので私はこんな ようにの形で資料を持ってもらうのが普通 [音楽]になります。で、もしPDFしか ないよっていう場合ではだったらですね、 こちらPUDFからPN[音楽]に変える そういったサイトがあるので、にPDFを 入れてもると画像決に変換できるので [音楽]使ってもらえるというかなと思い ます。この後もですね、後ろ出てくるので その時に使い方を紹介していきたいなと [音楽]思います。はい。それとですね、 ホーム画面に戻ってきましたらスライド 生産の仕方を紹介します。あと1つ目だ ですね、スライドの相案だったり ストーリーラインみたいなものを構築して いくっていうところになります。例えば ですね、置いたプロンプ打ちます。今回 ですね、生成活用による業務化についての 営業スライドを作成したいっていうのが、 ま、目的化した時にファでま、スライダー の名前と今回[音楽]指定してみましょう 。で、こちらですね、ビジュアライズ見せ 方ストーリーラインナを空して見た人に点 ガあるような資料を作成してくださいと いう風にします。そしてですね、こちらが ポイントです。扇風資料のような レイアウトどンマナ文章量が目安です。と いうことでこちらでですね、今回のもの成 活用による業務効率化についての営業 サイドていうもののオブショだったり レイアウトあとはトンマナっていうのを 画像を元に調節[音楽]してもらうと一旦 こちらやっていきましょうか。これで参考 にするシールはねしていきます。はい。そ したらこちらで一旦こちらの画像を貼っ たらあとは送信して始めていくだけなん ですがこちらですね。ジミニアとちょっと 欠点が1つありまして[音楽]はい。 こんなようにですね石座にアプローできる ファイルですね。画像の宇宙権までな [音楽]ので、もしデザインだったりは すごいバリエーション多くて、こうもっと 参考になる資料再現したいスライドを貼り たいよっていう、そういった場合あるかと 思うので、その後にの解決策を2つ紹介 できればなと思います。はい、まず1つ目 はですね、こちらGoogleAスタジオ という場合になります。こちらですね、 最新の準備ノーモデルも使いますし、 アップロードできる画像、ファイルって いうのも本当に多くなっております [音楽]。年々10万円は超えるね、画像 だったりも一気にアップロードできます。 例えばですね、1000円やってみ ましょう。はい。例えばですね、19枚 ファイルんですけど、こちらはい。この ように点[音楽]するだけではい、全てね 、アップロードされましたていうような形 でなのでこちらでしたらもうちょっと 大容量のね、スライドのテンプレートだっ たりっていうもんに対応できるようになっ ています。あとはね、同じようにプロンプ と落ち込むだけでいける。ま、こちらでも いいですし、もう1つ、Aあります。はい 、皆さんよく使われるGPTですね。で、 こちらですね、サイドバーに開い[音楽] てはい、こちらですね、プロジェクト新築 作成っていうところをしましょう。え、 そうするとですね、こちらできてね、 プロジェクト作成できるんですが、こちら で、ま、今回出スライドというような プライドというようなプロジェクトを作 ます。作ります。はい。ですね、こちら ファイルを追加するというところはあると 思うんですけど、はい、一気にはい、この ようにね、重なぐらいストレイドを一気に 読み込ませることができます。で、はい、 なのでこのプロンプとの時にこの テンプシト仕様という部分をじゃあ プロジェクトファイルの画像のような みたいなプロンプに変えればGPTでも 作成できるようになります。周域ですね、 この部分はもうAI何でも良いかなと思い ます。というわけで今回ダングSTでやっ てみましょう[音楽]。ちなみに注意点 ですがGoogleATに関してはここで しない会話あったりっていうものが学習に 使われるかもしれないよっていうそういっ た注意もあるので超鬼密情報みたいな場合 でしたら他のA使ってもらうと良いかなと 思います。という一旦ですねスタートして いきましょうね。はい。そしたらですね 上がりました。こんなアウトプットになり ました。ハイサイドの構成案ってことで レイアウトとか目的とか[音楽]掲載内容 っていうのがこのように書かれています。 な、文章量だったりとか、こう文字のね、言葉のね、文章あたりの雰囲っていうものが転付した画像の再現した形で当たってくだされます。はい。はい。これそうなのでコピーしちゃいます。 [音楽] はい。続いて使うのがこちらですね。ノートブックレムになります。こちらノートブックやの知能を使って先ほどのスライドの相案っていうものを画像で一旦形にしていきます。これですね、ノートブックを新規作成っていう部分を [音楽] クリックしてください。上でもね、いいきます。はい。 そうするとですね、このようにソース アップロードっていう部分がまず最初に 表示されるので、こちらでもアップロード してしまいましょう。でですね、こちらに アップするのが再現したいスライドの画像 をこちらにアップします。はい。そしたら ですね、このようにソースっていうのがね 、アップさ[音楽]れるかなと思うんです が、ここでやりたいことはですね、この 添付した画像のまた雰囲気だったり、 先ほど作成したスライドの相案というもの とこの画像ですね、クオリティっていうの をゆい感じに調整してアウトツクットを 出してくれるという風になってます。はい 。でですね、いい感じアップできまし [音楽]たので、先ほどもはい、この消子 1枚目から7枚目に至るまでの内容って いうものをコピーしたかと思うんで、 こちらをですね、はい。こちら ノートブックのスライド資料っていう部分 になると思うので、こちらのペンマークを クリックしてください。ペンマークを クリックしたらですね、え、このように 作成するスライドについて説明して くださいという風に注されてるこのロック ですねに先ほどのスライドを打ち込みます 。そしてやることとしてはこの内容構成 あったりとかを元にこう添付したね画像の ような感じの資料を作成して欲しいんです ね。なのでプロトとしてはですね、この 言ってみたらどうでしょうか?上期の スライド構成ですね。全7枚のみを参照し てその内容や構成ストーリーラインを再現 する形でスライドを作成してください。 ビジュアルやレイアウトは相下の指定を 意識してフライドを作成してみてください [音楽]という形でその指定がそれの デザインやレアとは添付した画像スライド の[音楽]ような本してアウトプットを 出してください。はプロトでオッケーです 。一旦出しましょう。生成ですね。オープ [音楽]します。はい。そしたらね、この ようにスライドが生成されるかなと思い ます。ちなみに1日にそんなスライド生数 しないよっていう場合はしない。この さっき詳細のスライドを選択してたんです が、こちらのAppleデンターの スライド押したバージョンで同じプロで 作成してるみたいなことをやってみても 全然いいかなと思います。同時標でね、 アウトプットを出せるので色々試験検討し ながらその時良かったスライドを選択する という形で全然問題ないかなと思います。 ではですね、アウトプットが出たら実際に 見てみましょう。というわけで、ま、 スライド生成ね、時間がかかるので釣り もう用意してたので、ちょっとこちらの方 で見ていきましょう。ああ、いい感じに できてましたね。良かったです。[音楽] 見ていくとめちゃくちゃ出せそうなぐらい のスライドのクオリティですよね。 やっぱり若干調整したいところとかあって ももう本当ね、いや、すごい[音楽]です よね。スライドのクオリティは本当に高く なりましたね。一応ね、同時平行で他の 使用作成の方出したのでそちらも見ていき ましょう。ブロンクトである程度指示を 固めているのでほとんどクオリティはね、 同じようなものになるんですが、ま、これ 中から特に自分の中でお気に入れのものを 見つけていくと[音楽]いう感じになり ます。ま、色々あるんですが、ま、今回は ね、これが1番見やすそうなのでこちらで 進めていきたいなと[音楽]思います。左 がですね、参考のスライドになるんですが 、どうでしょう?はい。なのでこういう ビジュアライズの部分までこのね、左の 雰囲気を元に[音楽]こう作成してくれて いますね。特に変わったのが7ノバナプロ の登場でしたね。これのおかげでできる ことがかなり幅は増えたのでGoogle がね、本当に展下を飛び[音楽]に来て ますね。今回はもうこれでいちましょうか 。はい。制限したいクオリティだなって なったらこれですね、ダウンロードって いうところがあるのでこちら押してもらう とはい、来ないんでですね。PDFって いうのでアウトプットが出てきます。なの でこのアウトを流れるとしたらこの画像を 参考に実際のスライドに落としていく、 再現していくそういったことになります。 はい。でですね、先ほどのね画像っていう ものがPDFなんですね。で、何度もね、 お伝えしている通り、このジムニトで制限 するには画像がね、1番、1番ね、成功 確率が高いんですね。もうこれ何回も試し たので間違いですな。なので先ほどの PDFっていうのを一旦画像に落として いきます。はい、こちらですね。ここの ようにアップロードするわけでないPDF が画像に変換されていきます。で、終わり ましたらこのように全てダウンロードって いうところをクリックするとこちらのね 内容がはい、このですね、PNGに変換さ れて手に入れます。はい。 ま、あとこれをね、今までの準備にだったり、あと今回ね、登場する新路使ってスライドを再現していくという風になります。ではね、再現していきましょう。 [音楽] ではですね、戻ってきました。おなじみのジミニですね。で、スレドスペースの方法はすごい簡単になります。これですね、ツールの部分からキャをクリックしまい、このモードですね、デルを速モードではなくですね、この思考っていう方に選択してもらったら準備は完了です。で、ちょっとね、今回再現したいっ。 [音楽] [音楽] はい、ではね、この画像を貼って、あとは こちらを一度コード形式に変換して スライドを生成するっていう手順を踏んで いきます。なので与えるクノンクと姿勢は このような感じで問題ないです。この添付 した画像スライドのようなデザイン ビジュアルフォントの手をとりあえず忠実 に再現する形でHTMLを作成して くださいという風にシすればオッケーです 。で、この後もね、プロンプですね。 じゃあ以前の動画でスマートなね、視聴者 様から頂いたんですけど、生成後は プレビューではなくAコードを優先的に 表示してくださいという風なこのと成功が 確率が上がりましょうというコメント いただきましたので、ちょっと今回も使わ せていただき[音楽]ます。あ、本当に 実践して、しかもプロンプタまでね、こう 組み込んでくれるとはやっぱりね、この 視聴者とはスマートラだなとちょっと感じ ました。いつもありがとうございます。と いうこちらのプロトと使って実際に生成し ていきましょう。はい。このね、コード 形式でスライドが生成されそうになったら 成功です。はい、バッチですね。では実際 にもアウトフットまで見ていきましょう。 はい、というわけでね、デッキ上がりまし た。スライド[音楽]ですね、このような 感じになりました。どうでしょう?もう ほとんどね、こういう時代は再現できてい ますよね。本当にね、いいと思います。だ からこちらはあとは実際にエクスポート できる形が欲しいですよね。なのでこちら のコードをダウンロードできるようにして いきます。でですね、このコードをですね 、全てはい、このようにコピー[音楽]し ちゃいます。はい。で、最後ですね、あと 1歩です。頑張りましょう。はい。まず ですね、このように先ほをコピーした コードをコクピペしてその後にですね、 このような 添付したコードのテンプレートデザインを ビジュアルフントを中制限する形[音楽] の作成してくださいと。もし文字などが ずれている場合調整して宿格的に美しいに してください[音楽]。ちょっとね色々 実験していったんですが、ま、主角であっ てもはなくてもあんまり変わらないんです けど一応ですね参考クオリティですという ことでこちらですね。今回参考にしたい スライドっていうのを添付しちゃいます。 画像に変換した、あのスライドですねに なります。で、絶対準ということで アウトプットはそれにエクスポートできる ようにという風にして、またですね、ツル の分からまたキャンボしてモードになっ てること確認したら送信もします。 [音楽]はい。そしてですね、出来上がっ たのがこちらになります。はい。どう でしょう?いや、もういいですね。ここ まで再現できてたらもう十分かなと思い ます。実践に比べてみましょう。はい。 もういい感じですね。はい[音楽]。もう ね、かなりね、こうクオリティ再現できて ますね。はい。ま、こういった部分はね、 かなりね、改変されてはいるんですが、 特に[音楽]こういったビシャルズの ところが良さそうですね。はい。といった 感じで画像を添付してあげることで ほとんど画像通りのクオリティを再現して くれてるかなと思います。といった部分が ですね、例えばこう枠がずれたり収まらな いって場合は調整されたりするんですが、 ま、ちょっとご愛ですね。ご愛嬌なんです が、ちょっと今回ね、あるAIを使えば これをね、なんと解決できるわけです [音楽]ね。ま、ちょっと今回そちら紹介 したいですね。と、その前に実際にこれ スレードにエクスポートしてみましょう。 こちらですね、右上にスライドにエクス ポートっていうところがあるので、こちら をクリックします。[音楽]そしたらこの ようにアウトプットが落とされます。はい 。もうね、ほとんど同じかなと[音楽] 思うんですが、いかがでしょう?普通に見 やすいですよね。で、こういった部分は 編集可能で、複雑さの日常だったりグラ フっていう部分に関しては画像で変換さ れることが多いです[音楽]ね。そして 地味のGoogleスライドからの場合は パワーポイント変換するがあって、こちら ですね、チダ屋のファイルから ダウンロードでPPTXをします。はい、 というわけでね、Googleスライド からパワーポイントの変換の場合は保管性 がね、かなり高いので、お文字のフォント だったりが対応していない[音楽]以外に ついてはこのようにクラスレイドアウトと ほとんど同じウティで、え、再現されます 。このままね、一部消えてたりするわけ ですよね。こういった部分だったり、あと こういった画像の部分ですね、 ビジュアライズの部分に関してはこ編集 できないんですよね。この防グラフだっ たりとか、このグラフだったり、この文字 [音楽]ですね、ていう部分が、ま、 たまに変更できなかったりするんですね。 といった部分は可能だったりするんですが 、ちょっとなんとかしたいじゃないですか 。あとですね、ジェミンにね、 エクスコートできない時だっ[音楽]たり 、出力がね、安定しなかったりする場合が あるんですね。だ、そういった時の大体案 としても活躍するんですね。というわけで 、こっからはジミーとはね、別のAIに なるんですが、何ですが、ちょっと今回の この問題は全部解決できる。そういった AIをね、紹介したいと思います。それが ですね、はい、こちらですね、クロードに なります。はい、これ本当にすごくですね 、Exelだったりパワーポイントは かなり進化したんですね。なのでちょっと 今回はね、このクロードを使って先ほどの 問題だった量も関連対決して最高の スライドを作る、そういった方法をね、お 伝えしていきます。でも使い方は超簡単 です。こちらじっくり考えるっていうね、 問題になってるんですが、ここの時計 マークをクリックして青色にします。 そしてここですね、[音楽]モデル4.5 にするという風に出現もらえればもうこれ だけでオッケー。で、ちなみにですね、 無料バージョンですとこちら4.4.5は アップグレード必要そうなので、最低ね、 20ドルの課金[音楽]してもらうのが 必要になります。なので地味にの部分で いった生成してもらってあとさらに クオリティを上げたい。あるいはこうもう クロードをね、すでに使っているよって いうね、スマートなであればもうこちら クロードをバンバン使っていくよ。方向に シフトしても問題ないかなと思います。 もしね、ジムニノアスライドで脱得いか なくてさらにこう効率を上げたいっていう 方であればこのクロードに課金してこちら も使ってもらうのが良いかなと思います。 これスライド生成以外言ってもですね ライティングだったりポーリングだったり あとそういったexelだったりとか本当 に色々なことできるんですね。MCPって いうその他のね機能もかなり充実してるん ですね。ので、まあ全然20ドラするん ですけど、家計しそうはないかなと思い ますので、是非ご検討してもらえるといい かなと思います。はい、それではですね、 同じようにやっていきましょう。はい、 それではですね、早速ブロンピトと エルカードを紹介します。はい、まずです ね、これでは分布を打ちます。添付した コードのテンプレートデザインビジュアル フォントを抽再現する形での形の内容の スライドを作成してください。で、ま、 特にここら辺が大事ですね。アウトプット はPPKXの形式くださいと。こういう 指定があれば問題ないです。で、添付した 画像が参考です。ということで実際にね、 色々と添付していきます。はい、まず コードですね。こちらを貼ります。それが こちらになりますね。コードのテンプレド デザインに添付した画像が参考れていると いうことでジャのね、画像を貼ります。え 、まだアウトクタPPTX[音楽]形式で 指定できてればこちら送信を押すだけで 問題ないですやっていきましょう。あ、 ちなみにこちらのコードですね。ジェムニ で生成接したコードになります。はい。 そしてですね、まず1発目に出た、え、 アウトプットがこちらになります。はい。 どうでしょう?もう同じ声のクオリティ ですよね。はい。もいや、本当にね、黒 一気に性能上がりましたね。こちらで 例えばね、こういったところちょっと修正 したりそういった部分があればですね。と いうわけで直して欲しい画像をテプし上げ て、ま、ちょっと修正してくださいという 風にプロンプと指示しました。ま、そうし てですね、このような金でずれ[音楽]て いた部分に関してが修正されているように なってます。で、白定の修正性だったら 全然可能となっております。スライドに 起こしてね、修正するっていうことも もちろん可能です。今回ね、マスターね、 7枚とかちょっと多くなってくるとやっぱ 修正は追いつかなくなってね、ま、まず 出すのは5枚までするだったり、あと 手直しもね、もちろん可能なのでですね。 それではですね、クロードの方でも エクスポートダウンロードの仕方を解説 [音楽]します。こちらドライブのアイコ ンっぽいのがあると思うんですけど、 こちらで開いたらプルサラで変換[音楽] されます。はい。そしてね、このようなね 、綺麗な形でエクスポーツされていきます 。で、パワーポイントそのまま欲しいよっ ていう場合はですね、こちらのダウンロー ドっていうところを押してもらうと ファイルがダウンロードされ同じまま [音楽]アウトプットが出されます。で、 もちろんね、こういう細かいところも全て 編集可能になっている[音楽]ので、この グラフの大きさとかもね、調整できちゃい ます。なので全てのね、文字だったりとか 文字、全てもね、文字だったりを編集可能 という感じになっています。これがね、 10mmと比べてやっぱり突き抜けてる ところですね。それでですね、もっと別の スライドで試してみましょう。のね、動画 にも使ったキャンバでいい加減の テンプレートがあったので、また今回もね 、こちらを再現する形でやっていきます。 こちらですね、画像ダウンロードしておき ます。はい、というわけではこのように 修理ポートがあった時にこの内容をいい 感じにまとめてそれをスライドにするって いうのをもうAIのみを使ってスライドに 変換するっていう一段の流れを実践して いきたいなと思います。これ完全にダミー データです。こういったのをこう読み込ん で実際にね、スライドに落としてくったり するってのはすごい大変だと思うんですね 。これもね、一瞬で作成できちゃいますの でやっていきましょう。はい、なかなか なくて今回ね、GPTにこういう風に聞い てみましょう。今回ね、GPTを使って いきます。またプロジェクトを作っていき ましょう。はい、ではね、また プロジェクトを作成していくんですが、 ライド作成という風にしましょう。で、 作成をします。はい。で、実際にね、参考 ちゃい画像をこんな感じで全部決め込ませ ました。あとはね、じゃ、同等してこのね 、トマに沿った作成してしまいます。はい 、というわけでね、ストロンプタコニし ました。添プタドキュメントにある 2015年10月終のエアポートテシティ サマリーについてスライトを作成したいと いうことでアレンジファイル画像のような レイアウトポンマナ量がメスいう感じの ポクを行きましょう。Google ドキュメントと連携して貼りました。なの でこちらでちょっとアウトプットを出して いきます。はい、送信でオッケーですね。 送信いい感じのやつができましたね。はい 。スライドねしっかり作成してくれていて もね分かりそうですね。はい。良さそう です。で、実際にあとはもうこれを作成し ていきましょう。これをね、再現する形で 作成していきましょうか。これそれで4枚 目のね、ハイライトがどういう感じになる かとかちょっと楽しみですね。いった使用 にだったりも実際に生成していきます。 はい、というわけで次はですね、 ノードブookに戻るでしたね。では ノートブックをまた新規作成して参考にね 、スライドの画っていうのをアップして いきます。今回はね、こういったものに なるかなと思うんですが、ま、一部失敗し たんですが、一旦こんぐらいできてれば 問題ないでしょう。で、こちらもね、失敗 したソースちゃって、はい、また今回も スライドをスライド作成していきます。 またこちらのスライド資料っていうところ をクリックしてはい、このスライドを添付 してゲット先ほどの流れと同じような プロンクで上期のスライドを長期の スライドを参照してデザインやレイアウト は添プの画像のような感じのお願いします という風なプロトへしていきます。はい、 というわけで出来上がりました。タキー見 ていきますとはい。いや、すごいですよね 。めちゃくちゃ見やすくないですか?もう ノえでしょって感じですよね。はい。もう いや、すごいですよね。見やすいですね。 本当にもうこういうビジョライズできる ようになった本当に大きいですよね。はい 。もうめちゃくちゃいいと思います。これ でいいですね。行きましょう。はい。 例えばエグゼクティブサマリーの部分とか もうん。めちゃくちゃいいですね。 コンテンツ今週のハイライトですよね。 はい。この部分がしっかりビジュアライズ されてますで。はい。もうめちゃくちゃ いいです。完璧です。で、KPサはこの ような表式になっていてはい。というので できたので実際に失定したやつと比較して いきますとはい。もう良そうですよね。 はい。で、スライドにもうくじ回でもう めちゃくちゃですね。で、3つ目も エグゼクティブサマリーの通りになってい て4枚目もはい。もうこのハイライト めちゃくちゃ分かりやすいですよね。最高 ですね。はい。出スライド5枚目もはい。 もう表消し完璧に再現できたバスでいや 本当にめちゃくちゃいいと思います。参考 にしたねスライドのクオリティっていう クオリティのトマナだったりかなり再現し てくれてるのでありですよね。本当にえ、 もう色々だったりもねんど似ているので 一旦もこちらで全く問題なさそうなので ダウンロードしていきましょう。はい、で はねDFでダウンロードしたのでこちらで PNGに変換していきます。はい。では ですね、ギャンバスモードタンバスをまた 押してシモしてはい。再現したスライド なり貼って、え、この添付した画像の テンプレートデザインを、ま、中実再現 するHDML作成となるようなポイントと 落ちます。やっぱりコスとしてはもう できれば画像は1回でね、生成する スライドは5枚ぐらいにしておいた方が 良いかなと思います。と途中で終わっ ちゃったりとかしてもしてしまうので枚数 が多くならば分割してやるようにし ましょう。なんですけども、今回一旦この ままやっちゃいます。はい、というわけで ね、こんな感じでコードになってる形での ガープができました。これ画像の通りじゃ ないですか?ほとんど問題なさそうなので またね、こっちのコードをコピーします。 またコードを貼ってその下は蒸気の スライド、蒸気のコードでね、スライドの 文字や表がずれてる部分だけなく直して その他の部分を制限してエクスポート できるようにという感じで指示を出します 。はい、とやっていきましょう。いや、 もう飛んじゃいます。はい、というわけで 出てきました。めちゃくちゃ良くないです か、もう。はい。いや、もういいですね。 いい感じですね。あんですけど、若干小学 が下に行っちゃってますね。ま、手直しで すれば全然大丈夫であるんですが。はい。 ま、でもクオリティ自体はもう本当に 素晴らしいですよね。はい。こういった 部分だったりもはい。もうはい。もう なかなかね、素晴らしいかなと思います。 ということでね、皆さん聞いたこの クラウドロードの方でアウトプットも見て いきましょう。はい。プロンプはね、えっ と、同じような形で若干カラーがこちら ですね。アウトプputはPPKXの景色 でというようなプロンプタで最初も テジェンと同じような形でプロンプトも 打ちました。え、画像とね、コードとこの プロンプでアグタPPTXの景色という 感じでこのアウトプットができました。 はい。もこちらもちょいいですね。はい。 はい。めっちゃいいかと思います。じゃ、 1回こちらダウンロードしてみましょうか 。はい。まずGoogleサイドがこちら になります。はい。めちゃくちゃ見やすい ですね。もうシンプルに分かりやすくて、 もうこれでいい感じをしてます。で、 もちろんこちらのこういったはい、クラフ だったりも編集可能で、この回ね、文字 だったりも全部いじれちゃいます。いや、 もうめちゃくちゃいいですね。はい。 ポイントの方でも見ていきます。はい。 こちらね、パワーポイントになります。 もうね、ほとんど同じかなと思うんですが 。はい。もちろんね、こちらの方も全て 編集可能になっております。はい。もう めちゃくちゃ便利です。もうこうやって スライド出した後が編集可能かどうかって いう部分がすごい重要な点だと思うんです が、もうこれができるようになったのが 本当にね最高ですね。はい。パワー ポイントできました。まあね、まんま アウトグッドが出るんですが、はい。もう しいね、細かい部分まで調整で打ちますね 。文字だったりしもそうですしはい。これ いじらない部分ないですね。こういった グラフももちろん長さを調節。こんな感じ でめちゃくちゃ品種ですか?この編集無視 さみたいな部分を比べてももうクロロード が正直とかなと思うんですが、ま、ジムに でも十分なものは作れるかなと思います。 はい。なおそらく地味たらね、置いた部分 がこう一度なかったりするんですよ。数字 とか黒の方でしたら全て編集可能という 感じになってます。もう素晴らしいですね 。ミスもね、ような感じで自分の再現する したいスライドを用意して内容の構成だっ たりストーリーラインだったりはAIに 作成してもらいそれをジだったりクロード 使ってサイドに乗ってその内容を ノートブックやレモ使ってビジュアライズ して最後はジミーだったりクロードを使っ てそのサイドを再現するといった方法で 進めるのは今ね1番良さそうかと思います 。はい。というわけでね皆さんお疲れ様 でした。かなり長い動画にはなったんです がこの一通りのやり方を覚えてしまえば 間違成に関してはこうトップレベルのえ 活用ができるかと思います。前回もね、 この動画を見直したり、あの、自分での プロンプト組んだりとかして色々調節し ながら自分の形に合うプロンプトとあと 流れですね、プロセスっていうのをこう 構築してもらえるというかなと思います。 ま、ま、一旦まずは主張りじゃないんです けど、1回ね、紹介した方法から、ま、 まず取りかかってみて、そしてね、何の 目返してもらえるのは言たなとは思います 。あとね、どういうスライブはクオリティ 高くてどういったものがあったら再現し にくいかみたいな、そういった共通だっ たり法則っていうものが、ま、否定見えて きたんですね。そういった部分をもう ちょっとね、私の方でまとめてみて皆さん もね、安定してね、実用で使えるような形 で皆さんに共有していきたいなと思ってい ます。ま、とりあえず今回ですね、やり方 を解説したので、まずこちらを皆さん真似 してもらって、今後もね、私の方で ポイントや個そをまとめて皆さんの方に 発信していきたいなと思っていますので、 是非チャンネル登録してお待ちして いただけるというかなと思います。はい、 というわけでね、今回もご視聴いただき ありがとうございました。ここまでね、 高度な情報だったり活用っていうのを終え てる方はAI時代において間違いなく スマートな方々なんと確信しております。 この動画をね、見てもらったら分かる通り 、このAIを使った形でのスライド生成の 方法知ってるか知っていないかだけで生産 性で何倍も差をつけられる。逆知ってい ないだけで他の人に何倍も差をつけられる 。そういった時代に差しかかってるわけ ですね。例えばこのチャンネルはですね、 引き続きこういったAIの時代において 重要な情報だったり本当に使える活用術 っていうのを発信していきますので、ま、 そのスマートな皆さんは是非この チャンネルを登録して最新の活用術って いうのをこうインプットしてもいいご実務 だったりとか日々の生活の中で活用、日々 の生活の中で今回はない、え、価術を 生かして、そしてね、市場価値の高い、 そういった順にね、私自身も嬉しいなと 思っております。まだ初めて1ヶ月も経っ ていないぐらいなんですけど、本当に皆 さんのおかげでこのチャンネル強い自由で 伸びております。これがもうどのAI チャンネルよりも本当に実用と引きで有益 な価値だったに情報をお届けしたいなと 思っております。コメントや質問も どんどん募集中です。皆さんのおかげで このチャンネルの運営する励みになって おりますので引き続きよろしくお願いし ます。それでは本編もありがとうござい ました。",
    "word_count": 14791,
    "duration_seconds": 1549.24,
    "fetched_at": "2025-12-12T01:03:42.882603",
    "title": "AIスライド作成革命"
  },
  {
    "video_id": "qIO48Zkm764",
    "language": "ja (auto)",
    "full_text": "皆さんが当たり前に使っているであろう Googleドキュメントだったりとか Wordノージョンみたいなところ実は もうそれ時代遅れかもしれません。改め ましてこんにちは。れんです。突然ですが 、皆さんが今開いてるそのノーであったり とかメモ帳のアプリ、Google ドキュメントたくさん今世の中にあると 思うんですけど、それ本当にあなたの思考 を最速にしてくれますかというところで、 この動画ではGoogleの無料 のジェミニCLIと、ま、ただのメモ帳に しか見えないオブシディアン皆さんもしか したら初めて聞くよっていう方もいるかも しれないんですけど、そのオブシディアン を組み合わせることで、ま、ノーをはるか に超えるテキストの生成であったりか、 スライドの生成であったりか、さらには 思考の整理まで全てを可能にする方法を 今日お伝えしていこうかなと思います。 はい。ノ衛とかその辺りのGoogleの ドキュメントとか、ま、メモ帳のアプリ皆 さんたくさんね使ってると思うんですけど 、ま、その辺りと違うってどういうことっ て思いますよね。つまりそれっていうのは ノとか今Googleのドキュメントだっ たりWordとかであったりとかそういっ たツールでメモを取って今はね Googleュメントについてますけど その辺りで文章を整えてもらったりとか 生成してもらったりとかまそれをまた スライド生成するってなったら別のツール に貼り付けてGNスパークに貼り付けてと かマヌスにお願いしてみたいなところで スライドを作るみたいなそんな面倒な アプリの利き機とかも一切不要になります 。ま、確かにノーションって卓用だけど 使いにくいな動作が重いってことはまあね 、あんまりないと思うんだけど、AI使う のに課金しなきゃいけなかったりとか、ま 、もった他機能にAIを使い倒したりとか 、もっと業務効率化したいとか、ま、そう いったところがあるかなと思います。 例えば、ま、その他AIに指示を出すたび にWブページを行ったり来たりしてコピー するのが面倒だったりとかはい。いろんな ツールに情報が散らばっていて、ま、 Googleドキュメントに保存したっけ な、Googleドライブに保存したっけ な、それともドロップかなとかどこにメモ したっけみたいなところって結構あるかな と思います。結局あの情報どこだっけ?で 、またゼロから作り直したりとか調べ直し たりとかそういった時間ってめちゃくちゃ 無駄じゃないですか?はい。その感覚 めちゃくちゃ正しいです。はい。何を書く ?僕自身がそうでした。はい。で、例えば ちょっと前までだったらYouTubeの スライド、YouTubeの台本みたいな のをノにまとめてそこからAI エージェント開いて、ま、コピーペーして もっと情報量多くとか分かりやすくみたい な指示をして、出てきた答えをまたコピー してノスに貼り付けて1つの台本作るのに も、ま、いくつかのアプリを使ったりとか 、そしてそのできた台本からじゃスライド こんな感じのね、スライドをスライドを 生成しようってなった時に、ま、その スライド生成用のプロンプトを覚醒してで 、ジェンスパークに投げてみたいな1つの 、ま、タスクをこなすのにも、ま、 めちゃくちゃツールを分散して使ってたり とか本当にぐちゃぐちゃだったんですね。 これめちゃくちゃ面倒じゃないですか。で 、そういった悩みを、ま、解決できるよう な今日はお話しようかなと思うんですけど 、もしあなたがこのようなやり方を続け てると、で、10分で終わる作業が、ま、 1時間も2時間もかかってしまったりとか 、ま、あなたの周りのライバルたちがAI を使いこなしてるのに持続300kmで 変化してるか、あなただけ必死に自転車を 超えてるみたいな、ペダルを必死にこい でるみたいなそんな状況になったりとか、 ま、せっかくの素晴らしいアイデアが 思いついても形にするのが面倒で誰にも 知られることなく消えていっしまうとか、 ま、そうならないために今日この動画1本 で全てを解決していこうかなと思うんです けど、ま、答えはオブシリアンとはい、 メモ帳のアプリですね。オブシリアン Googleの無料のAI、この2つを 組み合わせることでできるようになります 。ジミニCLIってなんかターミナルで 操作しなきゃいけないんでしょうとか、 そもそもジCLIって何とか、なんか難し そうな名前できた出てきたなみたいな ところとそういった方もいるかもしれない んですけど僕はこの方法でAIと対話する だけで仕事を進めるバイブワーワーキング みたいなバイブコーディングみたいな ところもやってますしバイブライティング みたいなところとかもやってますしそこ からま今ねこうやってYouTubeの 発信してますけどYouTubeの発信し ながらLP作ってホームページ作って Webブアプリ立ち上げみたいな複数の タスクをAIと対話するだけでできるよう になってきました。はい。この動画の本編 ではですね、ま、具体的な手順のステップ バイステップみたいなところをお話しして いきながら解説していこうかなと思います 。ということで本編に入る前にこの チャンネルをまだチャンネル登録してない 方はチャンネル登録とベルマークを よろしくお願いします。で、今だけ僕の 公式LINEでは完全未経験でも挫折ゼロ で始まるバイブコーディング完全攻略動画 をプレゼントしてるので是非受け取ってみ てください。ということで早速本編に入っ ていこうかなと思うんですけど、ま、この 方法でできることっていうのは実際にこの スライドとかもはい、CLI型のAI エージェントで作ってもらってます。台本 の中、このスライドの中のテキストみたい なところとかも作ってもらってます。はい 。こういったところだからね。で、じゃあ それをどうやってやっていくのかって言う と、ま、ステップ1でオブジリアンの セットアップっていうところから、ま、 カーソルのエデター、カーソルっていう エディターを使うんですけど、ま、これも めちゃくちゃ分かりやすく解説してくので 大丈夫です。じゃ、なぜそもそもカーソル が必要なのかみたいなところも軽くお話し しておくと、ま、AI、AIがそこにも くっついてるんですね。なのでそこで セットアップで迷わないようにその カーソルを使ってMCCLIの セットアップをしていこうかなと思います 。で、そこから、ま、プロンプトみたいな ところも説明していきながらオブシリアン とジムニCLIとか人のエージェント クロードコードみたいなところとかもあっ たりするんですけど、それを使ってどの ように業務効率化みたいなところをして いくのかっていうのをお話ししていこうか なと思います。で、実際にこの動画の台本 とかもね、オブジリアンとAI エージェントを使って生成してるので、 はい、このスライドとかもね、使ってます と。なので、その辺りとかもお話して いこうかなと思います。前置きは長くなっ てしまったんですけど、プログラミングが できなくても大丈夫です。画面が怖くなく ても大丈夫です。ということで、あなたの 第2の脳を作っていきましょうみたいな テーマでお話ししていきます。はい。それ では早速ですね、オブシリアンと検索して いただいてはい、1番上のこのよく分から ない紫のマークのものをクリックして いただいて、ま、ゲットオブシリアン みたいなところを押すと、ま、自動的に ダウンロードが始まるので、そこから ダウンロードしてもらったらオブシリアン が使えるようになると思うので、僕はいつ もアプリ、アプリケーション開く時は コマンドスペースを押してはい。 スポットライト検索みたいなので オブシリアンっていうのを、ま、 アプリケーション開きたい時はこれで アプリを開いてますと。で、オブシリアン が開くと僕の画面を実際にお見せしようか な。最初はね、お見せしようかなと思い ます。はい。僕はこのような画面で作成を してます。で、1番右側にはですね、 ジェミ2みたいなターミナルを表示させて 、そこから左の画面でテキスト生成を行っ たりとかしてます。で、ま、簡単に最初 どんな感じでできるのかなみたいなところ をお話ししようかなと思うんですけど、1 回閉じますね。この辺りをオブジリアンを 開くとノーションとかGoogleの ドキュメントとかと結構違ってくるのが ローカル上にファイルが保存される、 フォルダーが保存されるみたいなところ ですね。で、ローカル上に保存され るっていうのはどういうことかって言うと ノーとかGoogleドキュメントとか、 ま、Wordはローカル上ですね。で、 その辺りと何が違うのかって言うと自分の パソコン上、ローカルっていうのは自分の パソコン上ですね。で、クラウドっていう のはクラウドとかWebブサービスとか ノーとかGoogleドキュメントは クラウド上に保存されてますね。それが その違いです。なので、ま、ドライブに 保存されてるのか、それともローカル上に 保存されるのかみたいなところで分かり やすく言うとMacBookに ファインダーみたいなところがあるじゃ ないですか。ファインダーを開いてもらう とこのような形で僕はオブシリアンはこの ようなホルダー構成で作ってるんですけど 正直ぐっちゃぐちゃです。ぐっちゃぐちゃ でも結論いいと思ってます。なぜならAI が探しに行ってくれたりとかAIが サポートしてくれるので、ま、ホルダーの 構成とかあまり気に、最初はあまり気にし なくていいかなと思います。目的は、ま、 作業効率を上げるだったりとか、その作業 のスピードを上げるみたいなところを重き に置いていきたいので、ま、その辺りとか は、ま、フォルダーとかはいいじって いただければなと思うんですけど、こんな 感じでファイルみたいな形で保存されて いきます。はい。拡張子がMDみたいな 感じになっていて、ま、実際にファイルを 覗いてみるとこんな感じでマークダウン 形式で保存されていますと。で、それを見 やすくするのがオブシリアンみたいな形で 覚えていただけると分かりやすいかなと 思います。はい。こんな感じでですね。 全然違うじゃないですか。実際にこれ マグダン形式で書かれてるんですけど全然 見やすいじゃないですか。で、そこから、 ま、いくつかオブジリアンの基本的な操作 みたいなところをお話ししていこうかなと 思います。最初にファイルを作ると時には 新規フォルダーみたいなところでテスト フォルダーみたいなところを作って いただいてその中にノートを作成すると無 のファイルが作られますとなのでお好きな 名前に変えていただいてはいはいそうする とこのような形で自由にテキストをかける ようになります。で僕はいつも作業してる 時にアクアというアボイスというAIの 音声サービスを使ってるんですけどそれを 使うとま、よりはるのですごくおすすめ ですと。はい。今実際にこんな感じで見え てますね。そうするとこのような形で テキストが打たれるんですけど、ま、実際 のメモ帳アプリとかノーだったりとか Googleドキュメント、Word みたいなところと同じですと。で、簡単に ご説明するとプラグインみたいなところが あったりします。で、プラグインンって いうのは何なのかって言うとオブジリアン を拡張するツールですと。で、その辺りと かもおすすめのプラグインとかもお話しし ていきます。で、まずは基本的な操作の ところから説明していこうかなと思うん ですけど、左のメニューバーみたいな ところを開くと、ここにフォルダーとか 自分が作成したファイルが表示されますと 。で、右側にも実際にプラグインで入れた ものとか、ま、リンクであったりとかその ようなところが表示されますと。はい。 こんな感じでですね。で、カレンダーが 表示さしたりとかすることができますと。 はい。で、このような形で実際に YouTubeのリサーチみたいなところ とかもこの行ったりすることができたりと か、AIと組み合わせることで YouTubeのリサーチをしてそこから テキスト生成してみたいなところもでき たりとかします。で、その他看板っていう プラグインを入れるとこのタスクの管理 みたいなところができたりとかはい。し ますね。で、じゃあこれはこんな感じで タスクリストみたいな形で表示することも できたりとかします。で、看板ボードとし て開く時はこの点線から看板ボードを開く みたいな形に押すとはい。また理由が変え られたりとかします。で、僕の最近の ポストでそのね、ポストで、ま、 フォロワー1000人ぐらいのアカウント なんですけど、そこで反応があったのは、 ま、マインドマップの投稿ですね。はい。 マインドマップもオブシリアンで使える ようになると。で、そこからマインド マップが作りながらAIと対話することで そのマインドマップも拡証することができ たりとか、そういったところが可能になっ てきます。はい。実際に、ま、元々ね、ま 、小じさんっていう方がいらっしゃって、 そのポストを見て、あ、すごいなと思って 僕もマ似して、ま、オブシリアンを以前 から触ってたんですけど、あ、そういえば ノ、そういえばマインドマップみたいな プラグインないかなと思って探してみて、 実際に触ってみたところめちゃくちゃ 良かったので、はい。このポストをしたら 結構多くの方に反応いただけてるので、あ 、じゃあ動画を撮ろうかなと思って ちょっと解説動画を撮ってるんですけど、 で、マインドマップはどういうところで 生きてくるのかって言うと、例えばこの ような形でちょっと今例えばなんですけど 、ま、このような形でマインドマップを かけたりとかはい。で、実際にこの小 みたいなところとかを思考の整理で作り ます。そこからAIに拡張してみたいな ところでお願いしてマインドマップを拡張 してもらったりとかしてます。で、非常に この辺りとかすごく使いやすくて、この プラグインとかも後々ご紹介していこうか なと思います。で、このような形で オブシリアンとCLIエージェントを使う ことでめちゃくちゃ仕事の効率化ができる ようになりますと。で、実際に コミュニティのそのプラグインみたいな ところのご説明をしていこうかなと思い ます。で、実際に左のメニューバーの ところを開いていただいて、そこから設定 の歯車マークみたいなところがあると思う ので、そこをクリックしていただくと、ま 、いくつかエディターについてとか ファイルについて、外観、ホットキー、 プラグイン、コミュニティプラグイン みたいなところが並んでるかなと思います 。で、今回使用していくのはこの コミュニティプラグインをクリックして いただくとプラグインを入れることができ たりとか管理することができるようになり ます。で、はい。で、実際にその新しく コミュニティプラグインを入れたい時は このコミュニティプラグインの閲覧を押し ていただくと複数なプラグインがもう めちゃくちゃプラグインあります。はい。 で、やりたいことは大概できるようになる かなと思います。で、実際に僕が使用し てるプラグインで言うと、ま、いくつか プラグイン入れてみて触ってみたんです けど、ま、結局AIに触せたりとかそこ まで多くのプラグインは必要ないかなと 思いつつ、1番重要なプラグインとかをお 伝えしていこうかなと思います。ま、1つ 目がマインドマップですね。はい。ハンス マインドマップいくつかそのマインド マップのプラグインあるんですけど、僕が 使いやすかったのはそのエンハンス、 エンハンスのマインドマップが使い やすかったですと。もう1つが、ま、 ギットはなくてもいいかなと思います。 ギットは簡単にご説明しておくと、 バージョン管理みたいなところができたり とかするので、変更の履歴を遡ったりとか することができますと。はい。で、その他 看板のモダンっていうものを使ってます。 はい。で、他にマインドマップっていう プラグ円あるんですけど、これじゃなくて エンハンスマインドマップの方を使って ます。で、後々ちょっとこれは重要になっ てくるのがターミナルが重要になってき ます。で、ターミナルのところはまた別で お話ししようかなと思うんですけど、ま、 僕が対応してるのはこのマインドマップと ターミナルはマストで使ってますといった ところですね。で、もう1つその オブジリアンを使いやすくする上での ポイントは、ま、外観を変えることかなと 思います。で、元々はデフォルトで言うと はい。今デフォルトに戻したんですけど、 デフォルトで言うとちょっと文字が全体的 に黒かったりとか、この画面のUIみたい なところがちょっといまいで、僕は あんまりそのオブジリアン好きじゃないな と思ってたんですけど、実際に外観が管理 できると。で、はい。で、僕が使ってたの はどれか忘れちゃったんですけど、さっき ね、使ってたのはどれか忘れちゃったん ですけど、これかな?アトムかな?あ、 ちょっと違う気がするけど。ま、いくつか 試してみましょうか。 ま、文字が変わるやつとかもあったりするんですよ。文字の色がね、変わったりとかするやつがあって、デフォルトがこれで、で、スっていうのはちょっと一通り見ていきますか。この辺りはい。ちょっと色が変わったりとかするので、この辺りがめちゃくちゃ外観あるんで、お好きなものを選んで使っていただければなと思います。で、中にはちょっとガチャついてるものとかもあったりするので、そこはもうめちゃ、そこはもう好みになってくるかなと思います。はい。 [音楽] で、今回は少しいつも使ってないものを 使っていこうかなと思います。はい。 じゃあこれをテーマを停止みたいなところ とかテーマを有効化押すとできたりとか するので全然変わってないな。何使ってた か忘れちゃいましたね。これかな?あ、 違う。これインストールしてなかった? これかな?違う。これかな?これっぽいな 。ああ。ま、いくつか触ってみるといいか なと思います。で、実際にそのタイトルと か、ま、見出しとかを太文字にしたりとか すると文字が色が変わるよって言った ところもあったりとかします。もう1つ 重要なプラグインとしてはあれがありまし たね。Eプラグインでこれ、これが1番 重要ですね。エディッティングツールバー みたいなところとかも入れると実際に文字 を太文字にワンクリックでできたりとか はい。リンクを差し込むことができたりと かフォルダーを入れてくれたりすること はい。この修正みたいなところとかを できるようになってきます。ま、Word みたいな形でいじることができたりとか、 Googleのドライブドキュメント みたいなところでいじることができたりと かしますね。はい。この辺りとか中央揃い にしたいよとかはい。右揃いにしたいよ みたいなところとかもできたりとかしてき ます。はい。で、実際に看板、新しい看板 を入れたい時にはこの左のバーから看板 ボードを追加でテストみたいな形で打つと 実際に看板が作成されたりとか、ま、この 辺りとかもAIお願いすることで自動的に 作成できたりとかすることが可能になって きますと。なので実際にじゃあ続いて今度 はAIエデター、カーソルのAI エディターを入れて入れていこうかなと 思います。なのでカーソルをカーソルって 検索していただくとはい。カーソル、カー とかカーソルって呼ばれてるんですけど、 これを検索して入れて1番上を押して いただきますと。はい。で、ま、AI コードエディターみたいなところが開か れるんですけど、実際に今回はコードは 書かないので大丈夫ですと。全部AIにお 願いしていきましょう。で、Macの方は ここからダウンロードしていただいて、 ダウンロードが終わりましたら実際にまた コマンドスペースを押していただいて カーサーって検索していただくと開くよう になりますと。ここでなんですけど実際に カーソルを開くとこのような真っ黒い画面 が出てくると思いますね。僕 YouTubeのスライドを生成してくれ たりとか、また別のEファイル以外のM ファイルとかも開けるようになったりし ます。で、ここも0からコーディング みたいなところとかしないです。全く。 はい。全部クロードコードとかカルの エデターにお願いしていったりとかします 。で、実際に皆さんが見ている画面はです ね、実はい、このような最初にこのような 画面に出てくるかなと思います。なので オープンプロジェクトを押していただいて 実際にお好きなところにフォルダーを作っ ていただければなと思います。なので今回 はですね、せっかくなんで新しく僕も作っ ていきます。オブシリアンオブシリアン& AIというホルダーを作って開いていき ます。で、実際に開いていただくとこの ような真っ黒な画面がなってくるかなと 思います。で、ここからまず何をやって いくのかって言うと、CLIというAI エージェントをこのパソコンの中に インストールをしていきます。実際に CLIをインストールする時には ターミナルで操作をしていくんですけど、 実際にプログラミング未経権の方が ターミナルを開いてCLIをインストール していくってなるとめちゃくちゃハードル が高いので、このAIエディター、AI チャットを使えるんですね。ここの右側 から押すとはい、こんにちはみたいな形で 押すとAIと対話することができるように なります。はい、こんにちは。お疲れ様 ですみたいな形でね。はい。なのでこれを 使ってジミニシをインストールしていこう かなと思うんですけど、ジェミニCLI っていうのはターミナルで動く エージェントのことです。CLI型のAI エージェントめちゃくちゃ今ホットで ジミニCLIと、ま、いくつかあるんです けどクロードコードが今2強で、ま、 クロードコードが僕はいつもコーディング とかバイブコーディングしてる時に使っ てるんですけど、ジェムニCIも めちゃくちゃ優秀で大量なコンテキストを 読み込んだりとかすることができるので、 ま、実際にこのような形でね、ターミナル 動かしていくんですけど、こことかも非常 に使い方とかなれれば全然問題なく触れる ので、実際にジェミニCLIを起動して いこうかなと思います。で、ジニCの インストール方法なんですけど、はい。 実際にキータに記事を投稿してくださっ てる方がいるので、ここからスタートして いこうかなと思います。日本語の方が 分かりやすいので、この2本の記事を参考 にしていくんですけど。はい。それで コマンドを試すみたいなところがあるので 、これをコピーしていただきます。で、 実際にターミナルに貼り付ければ インストールできるんですけど、今回は カーソルを使ってインストールをしていき ます。なのでこの1番右下からカーソルで 先ほどコピーしていただいたものを送信 するとそうすると勝手に必要な揃ってない ライブラリー0から始める方であれば まホームVUっていうホームuが インストールされてなかったりとかノード がインストールされてなくてコマンドが できなかったりとかすると思うんですけど まその辺りとかを勝手に進めてくれるとな ので実際にジミニシエこのカーソルと対談 しながらこのインストールみたいなところ とかもお願いしで、AIにお願いすれば実 に進むかなと思います。で、はい。で、 インストールが終わったらですね、僕は もうすにジェミニCLIが入っちゃってる んですけど、この上のターミナルを開いて 新しいターミナルを起動すると起動してJ と打つとジェミニが起動されますと。はい 。で、今回は僕はGoogleの有料 アカウントを使ってるのでGoogle ワクスペaceのね、有料アカウントを 使ってるんですけど、無料のアカウントで も使えます。なので今回は無料で試して いきましょうか。はい。無料のアカウント で試していこうかなと思います。はい。で 、ログインができたら実際にこんな感じで こんにちはみたいな形でゴじってますけど はい。試するとAIと対話するように できるようになります。で、ここから、ま 、カーソルを使ってジェミニCIを動かし てもいいんですけど、カーソルといいん ですけどで、カーソルのエージェントとか も使ってもいいんですけど、そうなると こっち行ったり来たりするじゃないですか 。はい。カーソル開いてオブシリアン開い てカーソル開いてオブシリアン開いて みたいなところがめんどくさすぎるので じゃあどうせだったらオブシリアン内に ターミナルを開けるようにしようみたいな ところが今回の趣旨ですね。なのでここ から先ほど開いたフォルダーをこの作成し たホルダーを作成開いていこうかなと思い ます。で、新しく開く方はですね、この ファイルのファイルのところから、ま、 エリッ、エディットとかいくつかあると 思うんですけど、ここからオブシリアンの ニューボルトってものがあります。ニュー ボルトを押すとこのような画面が出てくる かなと思います。で、もしかしたら初めて セットアップした方もこの画面が出てきた かなと思うんですけど、ここから実際に 作成したフォルダー、自分の先ほど作成し たホルダーを開くにはこの開くから開く ボタンからですね、先ほどのこの オブシリアンのフォルダーを開いて いただければなと。先ほどカソルで作成し たホルダーを開いていただければなと思い ます。はい、ありましたね。オブシリアン AIっていう先ほど開いたものがあります と。そうすると真っさらな画面になって くるかなと思います。はい。で、新しく ファイルを生成すると実際にファイルが 作成されます。なので今回はその ターミナルでAIエージェントを動かして いこうかなと思いますので、セットアップ の方法としてはコミュニティプラグイン からコミュニティプラグインから閲覧をし ていただいてターミナルターミナルがあり ましたね、ターミナルをインストールして いただきますとていう公開を押して いただいて押していただくと実際に左側に このターミナルを起動させるような オープンターミナルっていうのが出てくる かなと思います。なのでオープン ターミナルを押すと、ま、いくつかね、出 てくると思うんですけど、 ドローイングイングレーションデフォル トっていうものをクリックしていただくと 、実際のカソルで開いたような画面になっ てくるかなと思います。なのでここでJッ と押していただくと、ジェミニシが起動 するんですけど、するんですが、ま、もし かしたら初めての方はパスを通すっていう 作業が必要だったりするかもしれません。 で、実際にこのジェミニCLI、ジェミニ を起動しようとしてもエラーが出てきて しまったりとかすると思います。なので その時にはその出てきたものをコピー、 この範囲選択ができるのでね、範囲選択し てるコピーしたらこのカーソルにコピーア ペーストでエラーを貼り付けていただくと そのパスを通す作業みたいなところとかを このカーソルのAIエデターがですね、 やってくれるのでめちゃくちゃおすすめ ですと。ま、手動でパソを押さなくても このカソルにお願いする方が絶対に初心者 の方はつまづかずにできるので試してみて くださいと。はい。で、ここからじゃあ どんなことができるのかって言うと実際に なんですけどGPTとか皆さん作ったこと がある方もいるかなとは思います。その他 複数のAIエージェントを作ったことが ある方もいるかもしれません。で、その時 にプロンプトをいちいち作成したりする じゃないですか。なのでここの、ま、そう なんですけど、そのプロンプトとかを、ま 、いちいち切り替えたりとか、大 エージェント切り替えたりとかするの、ま 、僕はもうめちゃくちゃ面倒だったんで、 プロンプト5コーディングの YouTube大性台本プロンプトみたい なところがあるんですけど、それを 貼り付きますと。で、プロンプト、 iPhone、YouTubeみたいな ところにして保存しとくと。そうすると メンションでこのプロンプトを呼び出す ことができるので、そのプロンプト通りに このエージェントを動かしたすることが できます。で、あとはですね、その他にも 僕がやっていたりするのはスライドの生成 ですね。スライドの生成をどのように行う のかって言うと、ま、実際にやってみ ましょうか。今MXま、チャンネル詳細 分析っていうをメンて呼び起こして、そこ からそこからこのHTMファイルってもの がオブシリアン上には表示されないんです けど、ホルダーの中に存在するので新しく スライドを生成してください。ような形で 押すと実際にこのGLIが生成した テキストとからそこからスライドの生成 みたいなところをできるようになってき ます。なのででCLIはGoogleの サービスなのでGoogleのリサーチ みたいなところとかも行ったりすることが できます。てなるとGoogle ジェムニシにたくさんリサーチとかもさ せることができたりとかそこからテキスト の生成ができます。から台本の生成ができ ますってなったらいちいちいろんなソフト を生きしなきゃいけなかったところがこれ 一括で管理できるようになります。かつ 無料で使えるのですごくおすすめに僕は すごくお勧めしてます。なのでその辺りで 業務効率化ができたりとかすると思うので すごくいいなと思っていてじゃあ実際に カーソルかけるオブシリアンでもいいじゃ ないかみたいなところの声があったりする と思うんですけどじゃカーソルっていうの はじゃ同じようにタスクをお願いしてみ ましょうか。ま、カーソルも同じように メンションでスライド、あの、ファイルを 指定することができるのではい。スライド 生成してみたいなところとかをお願いし たりしようかなと思いますが、基本的に この試合型のAIエージェントとか クロードコードっていうのはもう10分と か20分とか平気で走ってくれるんですね 。ただカーソルとかは今このような形で 生成してくれてますね。膨大なリサーチと かテキスト生成ってなってくると止まって しまったりとかするんですね。そこが唯一 の違いかなと思います。大量のテキストを 生成してくれるっていうのがこの試合型の AIエージェントで良かったりとか大量の テキストを読み込める。この今作成した フォルダーの中からどこにあったっけ? その情報みたいなところとかをこのAIに 聞くと表示してくれたりとかするのでそこ も大量のテキストを読み込んでくれ るっていうのもすごくメリットだったりし ます。で、このぐらいのファイルだったら 確かにカーソルとかでも1発でかなとは 思いますね。はい。で、僕はいつも作業し てるのはこのような形にして、ターミナル とテキストオブシリオンを開いて行ったり 来たりとか、ま、たまにははい。で、もう ちょっと思考深く思考整理したいなって 言った時にはこのね、エンハンスマインド マップを使ってエンハンスマインドマップ を使ってそのバイブコーディングのね、 マインドマップ使ってたりとかするんです けど、そもそもバイブコーディングって何 みたいなところか、ま、一言で言うとAI と対話する行動生成ですよみたいなところ とかを大型自分の中のシナリオを書きます 。ここからじゃあこれだけだと情報足り ないな、分かりにくいなっていったところ をジェミニとかクロードとかにお願いして 生成するとジェミニシャとかもこういって こういった形で許可を求めてくるんですね 。なのでここの2番目の許可はワンスなの かそれともオールウェイズなのかいつでも 許可するのかみたいなところを設定をして おくとこのオートアクセプトみたいな形に なるのでそうすると比較的ずっとロング ランし続けてくれるっていうのが僕はその カーソルじゃなくてこの試合方のAI エージェントを使っているメインですね。 で、今生成されましたってなるんですけど そうなった時にね、そうなった時にこの オブシリアンでは開くことができないん ですよ。何をするかと言うと、この マーケットアナリックスライドHTML っていうのをこのカーソルのところから 開かなきゃいけないんですね。このあり ましたね。このMファイルがMファイルを 探してみる。見てみるとこのような形で 作成されてるんですけどそこからはい。 このファイルのま、ドラッグアドロップで もいいですし、ま、パスのコピーみたいな ところを押していただいて、このタブで 開くとこのようになってきますと。はい。 チャンネルの分析ですね。僕の YouTubeの分析みたいなところとか もスライド化してくれますと。はい。成長 予測みたいなところとかも実際にスライド ができますと。で、全画面にすることも できるので、そこからプレゼン プレゼンテーションとして説明することが できたりとかしますので、めちゃくちゃお すすめですと。で、何回も話行ったり来 ちゃ、行ったり来たりして分かりにくいか なと思うんですけど、このような形で思考 の整理ができたりとか、あれどこに フォルダやったっけみたいな、ファイル やったっけ、どこにメモしたっけみたいな ところとかもに聞くことでそのフォルダー をフォルダー内を探してくれて教えてくれ たりとか、そこからまた別の思考をして くれたりとか、スライド生成してくれたり とか、そこからもしかしたらいい作りたい よってなった時にもHTMLとかCSSと か、ま、ウェブアプリとかね、普通にこの AIは作成できたりとかするので、ま、 その辺りをどのようにやっていくのか みたいなところで言うと完全未経験の挫折 0で始める5コーディング、完全攻略動画 っていうものを配布してるので是非見てみ てくださいということで結構喋ったんです けど、ま、もしその他に知りたいよみたい なところがあればコメント欄とかで使い方 とか色々お話ししていこうかなと思うん ですけど。はい。ということでいかがだっ たでしょうか?この動画が良かったよと 思う方はチャンネル登録とグッドボタンを 是非よろしくお願いします。それではまた 次の動画でお会いし",
    "word_count": 14379,
    "duration_seconds": 1723.96,
    "fetched_at": "2025-12-12T01:03:44.500180",
    "title": "GeminiCLI+Obsidian"
  },
  {
    "video_id": "vri3RfONGfM",
    "language": "ja (auto)",
    "full_text": "これまだ誰も公開しないんですけど、 スライドをAIで作る時はだけで修正いら ずのスライドが一瞬でできちゃいます。 どうもです。今日はGoogle最強AI のジェミニを使ってメモからちゃんと 使えるスライドに一気に化けさせる方法を 解説していきます。資料作りって構成を 考えたりデザインを考えたりそして実際に スライドを作り込む。この3台まで時間が 溶けがちなんですけどジェミニを使えば1 発で全て解決です。とはいえAIで スライドを作ったことある人なら分かるか もしれないんですけど、いざAIで作って みるとスライド自体はできたけどなんか 微妙じゃないってなること多いんですよね 。ただ僕もスライド作りに関しては めちゃくちゃ研究してて、ついにもう スライド生成はこの方法が1番いいという サイトを見つけちゃいました。先にヒント を出すとスライドを作る過程でスルーされ がちな時にある工夫をするってのが ポイントなんですよね。これだけで分かっ た方がいたらめちゃくちゃセンスいいです 。今のところあんまり同じような発信をし てる方がいないので是非今回の動画を見て こっそり真似しちゃってみてください。 概要欄1番上の公式LINEでもこういう 隠れAI情報を発信してるので興味がある 方はお友達追加して見てみてください。 それではやっていきましょう。 それでは実際の画面をお見せしながら ジェミーでスライドを作る方法を解説して いきます。正直この動画で1番重要な ところを出すんですけれども、まずで スライドを作る方法を最初に解説します。 基本的な流れはこのツールを使って スライドを作る方法と同じなんですけれど も、まず最初に今回スライドにしたい内容 をですね、レポートにまとめます。まとめ なくてもぶっちゃけいいんですけれども、 リサーチ結果だったりとかあるいはこう いう内容をスライド化したいなというもの をテキストに落とし込みます。これ ステップ0みたいなイメージですね。その 後今回スライド化する内容を1枚1枚構成 を作っていきます。スライド1枚目には こういうことを書く。スライド2枚目には こういうことを書くみたいなスライドの 骨組を作ります。ここまでは基本的にどの スライドAIを使う時もあるいは自分で 手動でスライドを作る時と同じなんです けど、次のステップ2、ここが1番重要 でして、この構成化したものを一気に スライド化するわけではありません。AI にスライドを作って欲しいという指示を 出せばできるっちゃできるんですけど、 例えば10枚とか20枚のスライドを1回 の指示で作らせるとどうしても処理内容が 多すぎて1つ1つの質が低くなったり、 あるいは全体の質が低くなったりすること が起きちゃうんですよね。なのでどうする かと言うとここめちゃくちゃ重要なんです けど1枚1枚スロイド化するってことが 本当に重要になります。この辺りは後ほど 画面を見せながら説明にするんですけど、 処理を一気にやるんじゃなくて、ステップ ごとに1枚目作ります。2枚目作りますと いう形で小さく分けてあげることで質も 高くなるし、結果的に質が上がれば修正の 個数もめちゃくちゃ減るので1枚1枚 スライド化する。ここめちゃくちゃ重要な ので覚えておいてください。ステップ3で 細かく修正っていうイメージですね。 じゃあ実際の画面を見せながら解説して いくんですけれども、まず基本的に リサーチ資料っていうのをこの左下の ドライブから追加ってところから追加して いきます。今回はワイヤレスイヤホンの 事業開発のスライドを作 るっていうところでこんな感じで新規 ワイヤレスイヤホンの事業戦略を一旦資料 にまとめてます。こちらはdeプリサーチ の方で作った内容をそのままドキュメント に行してますね。内容をざっと見ていくと かなり長くて20ページに渡ってこの ワイヤレスイヤホンを作ると仮定した場合 の新規開発の内容を市場リサーチだったり とか戦略だったりとか詳細に書かれてい ます。ただこれをいきなりスライド化して くださいって言うとさすがに情報量が多 すぎるので一旦これを構成に落とし込んで みましょう。ということで添付の資料元に スライド資料を作りたいです。まずは スライドにするための構成を作って くださいとこんな感じですね。で、内容は 新規事業提案なので例えば今回は車内会議 向けに作ってくださいと。誰に向けた スライドなのかっていうところでスライド の作り方も変わるかなと思います。車内 向けなのかあるいは社外向けなのかで スライドの質とか雰囲気も変わるので一旦 ターゲットを軽く書いておきます。そう するとですね、こんな感じで新規事業提案 次世代ワイレスイヤホンプロジェクト オーラちょっとかっこいい名前ですね。 こんな感じで構成を作ってくれています。 1ページ目、2ページ目、3ページ目 みたいな感じですね。今回は例えば19 ページ分作ってもらいましたけれども、 これを10ページにまとめてくださいとか 、もうちょっと膨らませて30ページにし てくださいという場合はベッドこちらで 指示を出せば内容を膨らませることも縮小 することも可能です。っていう形で スライドの構成案ができましたってところ でスライドを作ってくれます。ここからな んですけれども一旦作った状態でお見せし ますけどこのスライド資料を16対9の パワフ形式で作ってくださいと指示してい ます。スライドはインフォグラフィックさ せて作りテキストのみのスライドはNG です。このテキストのみのスライドはNG すっていうところでスライド形式に図に 起こしてくださいっていうところを指示し てます。テキストのみのスライドもたまに 出すことがあるので一旦制限をかけてNG っていう形にしてください。次が最後です ね。1番最初に軽くお話ししたんです けれども、1度に全てのスライドを作るの ではなく、1スライド目から作って ください。問題がなければ2ページ目、3 ページ目と順番に作りますと指示してます 。この指示がないと基本的にこの構成今回 で言うと19ページ分を一気に作って しまいます。ジミニは基本的にそうです。 先ほども言ったんですけれども、処理能力 がそこまで高くないので処理が めちゃくちゃ防大になってしまうので、 この指示がないとやはりスライドの質も かなり落ちるし、全体的になんかやっぱり 微妙だなみたいなスライドになってしまい ます。なのでここは1ページ1ページ作っ て1個の処理をまずはやってくださいねっ ていう処理する内容を制限してあげること でそこに集中してデザインとかあるいは 構成とかのスライドに落とし込んでくれる のでこの指示めちゃくちゃ大事なので覚え ておいてください。ていうところで指示を 出すとこんな感じでインフォグラフィック 化したものが出ます。なんですけど ちょっとここで注意点ですね。1番最初に ドキュメントを渡して構成を作って くださいと指示をしてから インフォグラフィッカするとなぜかこの上 のところプレビューボタンが出ないという 状態が起きてしまいます。これは僕のね 周りの人でも同じようにボタンが出ないと いうことがあったので仕様なのかなと思い ます。もしかしたらこの後アップデートが あれば治ることもあるかなと思うんです けど、一旦現在はプレビューボタンがない のでご注意ください。もし良ければ コメント欄とかでこうやってみると プレビューボタン出ましたよとか アップデートがあって今はもう出ますよ みたいな最新情報を知ってる方がいまし たら是非コメント欄で教えてください。 AIの情報って本当に1日位で細かい アップデートがあるので昨日はねなかった けど今日はあるみたいなそういう変化が あるので皆さんのねコメントで実際の機能 やあとはボタンの配置をねシェアして いただけるとすごいためになるコメント欄 になるのでご協力お願いできると嬉しい です。っていうところで現在はボタンが ないです。なのでその解決策をお伝えし ます。先ほどリサーチ資料を出してそこ から構成を作って1枚1枚スライド化 するっていう指示を出したんですけれども ここでもう1回指示を出します。スライド を作りたいです。16対9のパボ形式で 作ってくださいとか。 インフォグラフィック化させてテキスト のみのスライドはNGです。ここはさっき と全く同じですね。1度に全てのスライド を作らないで1ページ目から作ってねと いうシですね。ここは一緒です。で、この 下にですね、構成案。先ほどジェミニが 作ってくれた構成案をベタバリしてます。 そのままもうテキストでコピーしちゃって それをバーっとここに貼ってる状況ですね 。そうすると同じように インフォグラフィック化したスライドを 作ってくれるんですけれども、そうすると ここでコードプレビュー。ここさっき ボタンなかったですよね。コンソールを 表示とか更新とか真ん中のボタンがなかっ たんですけど、ベタバリーをすることで 先ほどと同じHTMLのコードが出て こんな感じで実際のスライド形式で見る ことができます。これが最なのか分から ないんですけど、ベタバりをすることで プレイ画面を見ることができるので、是非 試してみてください。ていう形でスライド ができましたので問題なければ2枚目作り ます。そうするとこうやって2枚目は こんな感じでスライドになってます。綺麗 なね形で問題定義をスライド化してくれて ます。ここを更新されちゃってるんです けどグラフがね今は表示されていますけど 表示がされてなかったので一旦僕の方で グラフが表示されてないので修正して くださいという指示を出しています。する と今更新されてるんですけれどもグラフが 出るようになってますて感じであとはね 同じように問題があればここ修正しねと かって言いますし、問題なければそのまま 3ページ目、4ページ目っていう形で修正 をお願いせずにそのまま作ってます。あと はですね、こんな感じでちょっと下にです ね、見切れちゃってますよね。もう ちょっとこのオーラの真ん中とかで ちょっと見切れちゃってるんですけど、 この右上のね、ズームですね。これを 90%80%とちょっとちっちゃくすると こんな形で全部見ることができます。 スライドの表示形式が間違ってるわけじゃ なくて、サイズがちょっと大きかったが 故えに崩れていたので、もしちょっと崩れ てるなって思う方はズームを小さくしたり 、あるいは大きくできるだけした りっていうところを試してみてください。 て感じで、え、4枚目、5枚目も作って くれてます。5枚目ですね、作ってくれて いいなと思ったんですけど、先ほど2枚目 から4枚目作ってくれてる時って基本的に この白背景だったんですよね。白背景に黒 文字っていう形だったんですけど、5枚目 ですね、特に何も指示してないんですけど 、背景が混用になって出てきました。1番 最初1ページ目出してきた時と同じ感じ ですね。5ページ目になってなぜか戻って くるという感じにスライドを出してきたの で、2枚目と4枚目も同じようにしてここ で指示をもう1回追加してます。で、そう すると2枚目ですね、こんな感じで先ほど は白だったけれども同じようなこの紺色の 背景に文字でスライドを作っているという ような形になってます。っていう形で1枚 1枚ダート作っていきます。今回は10枚 作ったんですけれども、その10枚を1枚 1枚見ないといけなかったので、最後に 作成したスライドを全てまとめてスライド 形式で次のページに切り替れるようにして くださいと指示してます。で、全てまとめ てっていうこととスライド形式で切り替え できるようにしてっていう指示を2つ入れ たところ、こんな感じで今回YSイヤホン の新規事業っていうところで結構かっこ いいですよね。この下のボタンで移動する ことができます。ワイヤレスイヤホンに 合う先進的なイメージ再リッシュでかっこ いいイメージとしてスライドを全部作って くれます。これだけでぶっちゃけスライド としてものすごいクオリティ高いんです けれども大事なポイントは1枚1枚作 るっていうところと作りながらプレビュー が見れる時と見れない時があるのでもし 見れない時は1番最初に戻ってベタバリー をするドキュメントとかをちょっと参照 するとなぜかプレビューのボタンが なくなるという謎の仕様があるのでここ だけ注意して作っていただければなという 風に思います。もしこんな形でHTML できたインフォグラフィックができて スライドのデザインができてるのに プレビューができないっていう場合はです ね、こちらの動画でもGoogleサイト を使ってこのHTMLをデザイン化する 方法を解説していたりします。もしその 動画見てない方はですね、そちらの動画も 是非見て欲しいんですけれども、こちらで ね、解説したやり方ってGoogleサイ トっていう別のツールをですね、 Googleのツールではあるんですけど 、別のツールでHTMLをデザイン化 見えるようにプレビューしています。ただ このジェミの中でやりたいっていう場合は ですね、さっきお話ししたようにベタバリ をするとできるっちゃできます。こんな 感じでこの内容をキャンパスで出力してっ ていう形でHTMLをですね、ここにもう そのまま貼ってます。そうするとですね、 キャンバスに同じように出してくれて、 今度はプレビュー化できるんですね。 こんな感じで2枚目、そして同じように ちょっと面倒ではあるんですけど、 HTMLを全部コピしてスロスのまま ベタバりするっていうイメージですね。 そうするとこんな形で今は3枚になって ますけども、全部10枚とか20枚、 こんな形でスライド化することができます 。ま、こっちもこっちで結構かっこいい ですよね。グラデーションかかった紫とか こんな形でデザイン化しているので、もし ですね、プレビュー画面が出なくてこう 困ったなって方は一度別のチャットを作っ てベタバりするってところも是非やってみ てください。 [音楽] そしてですね、スライドといえばやっぱり 修正したりとかあるいはGoogle スライドとかパワーポイントで修正したい みたいな方が1番多いニーズかなと思い ます。やっぱり1番慣れしいんだ。パポと かGoogleスライドで自分の好みに微 調整したりとかあるいは文言を修正したり とかデザインをちょっと変えたりとかって いうことがこの状態でできないんですよね 。できないからもうこれで一発作ったもの をプレゼン資料会議に出すとかあるいは 社外向けに提案資料として出すのは ちょっとさすがに無理がある実用的じゃ なさすぎるっていうところでこれをですね とかあるいはパワーポイントに出力する 方法もお伝えします。これフィグマをね、 使うとかね、他のツールを使って出力する みたいなことを発信してる方も多いんです けど、今回はフィグマとか別のツールは 使いません。今回はGoogleスライズ の中にあるガスという機能を使います。 これあんまり発信してる方いないんじゃ ないかなと思います。どこにもね、出して ない情報なので、めちゃくちゃ正直やり やすいですし、是非学んでやってみて くださいというところでガスを使っていき ます。スっていうのはGoogleが提供 しているプログラミングの プラットフォームで Javascririptとかを使って Googleサービススプレッドシートと かあるいはGoogleスライドの自動化 とか機能拡張っていうところをすることが できます。基本的にはこのコードを書いて 扱うツールになるのでエンジニアさんとか 結構使ってる方多いかもしれませ エンジニアですし全くHTMLも読めない ですしCSSも書けないです。コードが出 たら正直うわって思っちゃうので安心して ください。そんな僕でもめちゃくちゃ簡単 にできますので是非やってみてください。 というところで基本的にガスのコードも このジミニに書いてもらいます。書きの スライドを作りたいのでそのためのガスを 作ってください。Googleスライドに 円落とし込んでもレイアウトが崩れない ようにしてくださいって感じで1から10 まで統合したHTMLOですね。これも 全部コペしてそのまま貼っただけです。何 も修正点を付け加えてないです。というか 修正僕はできないのでそのままコピーし てるだけです。ちょっと長いんですけれど もコピーしたものですね。ていう感じで ガスをジェミニが作ってくれてます。作っ てくれたガスコードがこちらですね。 こちらもちょっと長いんですけれども、 この右上コピーを押せばそのままコピーが できます。スクリプトの使用方法も ちゃんと書いてくれてます。めちゃくちゃ 優しいですね。ただ今実際の画面を見せ ながらお伝えしていくのでご安心ください 。このJavaScriptのコピーをし てGoogleサイドですね、こちらで この右上の拡張機能ってとこですね。ここ にアスクリpトこれですね。これがガスに なるのでクリックしてください。そうする とこんな感じの画面になります。1番最初 ね、この2行のコードが書いてあるんです けど、これ全部消しちゃって大丈夫です。 ctrlAとか押すと全選択できるので 全部消しちゃって大丈夫です。消したとこ に先ほどのコピーしたものをそのままポン と貼り付けます。例えば今回は新規事業 提案所ということですね。名前を仮に決め ていただいて、ここですね、ドライブに プロジェクト保存のボタンをクリックし ます。そうすると今ここに新しい文字が出 てきたんですけれども、関数ですね。これ は1つしか選べないのでクリエイト プロジェクトオラプレゼンentテーション 。これをそのまま選んで最後ここで実行を します。実行1番最初ね、押すとこんな 感じで承認が必要ですということになるの でここで権限確認というところで Googleアカウントを選んでください 。という形で新規事業提案所が Googleアカウントのアクセスを求め ています。という形でこのアクセスを付与 することでプログラムを実行することが できるのでここで続行を押してください。 そうすると実行開始してくれます。早速 エラーが出ましたね。ガスを実行すると こんな形でエラーがけることがあります。 このエラー内容もぶっちゃけよく分かり ません。僕は何が書いてるかも分からない のでこれもそのままコピーしてこちらに 投げてみます。そうするとの報告 ありがとうございますって形で何が悪かっ たのかっていうのを原因を突き止めて修正 内容を作ってくれて修正コードをまた 書き換えて全部修正したものをまた貼って くれてます。こんな形でね修正が出れば 都度またコードを書いてくれるみたいな形 でジェミニに全部投げるだけです。自分は コードを書くとかコードのエラ原因が何か とかは丸投げです。ジェミニが全部解決し てくれて原因とかそれに対しての解決策 ってのは全部作ってくれてます。何回やっ てもダメみたいなところもあるんですけど も、そういう場合はこの1番最初ですね、 Googleスライドに落とし込んでもっ てところで画像を入れていると結構ここ エラーになりやすいです。なので画像を 抜きで作ってくださいとかって指示をする と指示がうまく通ったりするので画像とか あるいはロゴとかそういったものを HTMLに入れてそこからガスに変換 するって作業が難しかったりするのでもし そういうエラーが何回も起こる場合はここ の指示の出し方を画像抜きでとか簡易的に するようにしてみてください。こんな形で エラーとかも起こりながらもそれを地味に 投げて解決するとスライドができている ような形になります。ちょっとここですね 。もしが崩れていたりっていうことはある んですけれども、基本的な プレゼンテーションのデザイン感ってのは 1番最初ジェミで出したものとほぼ一緒 ですね。後ろのちょっとダークなぽ色の 背景に白地だったりとかこんな形でたまに 色をつけた文字だったりとかっていう ところを出してくれています。まだまだ 修正とか細かなレイヤー崩れみたいな ところは直さないいけないんですけれども ぶっちゃけまそれだけですね。それを直す だけでこのスライドに落とし込むことも できますし、あとは内容を追加したいとか 削除したい、修正したいみたいなものが あればいつも慣れしんだこの プレゼンテーションGoogleスライド とかで修正することができます。ポイント もこのファイルってところからこの ダウンロドってところでこの1番上の MicrosoftPowerポイントに ダウンロードすることでPowerポの 拡張士でデータとして落とすこともでき ます。なので簡単にこのJのスライドから GoogleスライドとかPowerPO のツールに落とし込むことができますね。 これあまり他の方発信してる方少ないので 、このやり方はめちゃくちゃ簡単なので、 基本的に指示も全部出すだけ。自分で何か 修正しなきゃいけないとか、自分でコード の間違ってるところを探さなきゃいけない とかっていう必要は全くないので、ただ ジェミに投げてそれをGoogleのガス に入れ込むだけで作ることができますので 、是非試してみてください。こんな感じで 今回解説した方法を作れるようになると 早くて質の高いスライドがあっという間に できて自分の時間もめちゃくちゃ開け られるようになります。ただ僕も過去に やっちゃった失敗なんですけど、開いた 時間を有効活用できなかったんですよね。 今回紹介したみたいにジェミニでスライド を作れば5時間かかる作業が30分くらい で終わるので、めっちゃ時間が余るんです よ。でもその開いた時間で他の作業をし たりただ友達と遊んでるだけだったので 時間を老費してました。その結果一瞬で 売上もガタ落ちしたし、何よりAIの最新 情報についていけなくなったんですよね。 AIってものすごいスピード感が早いので 昨日の情報すらもう古いってことが冗談 抜きでよくあります。ただ皆さんはこの 動画を見ている時点でものすごく情報感度 高いと思いますし、積極的にAIで業務 効率化をしたいっていう意欲の高い方 ばかりだと思うので情報収集したら自分で AIを触ってみるってところまでセットで やってみて欲しいです。知ってるのと できるのは点と地の差があるのでAIを 使ってこんな風に効率ができたっていうの があれば是非コメント欄で教えてください 。コメント欄を見るだけでもやる気が 上がるようにどんどんAIの情報をシェア してもらえたら嬉しいです。概要欄1番上 の公式LINEでも知ってるだけじゃなく てできるところまで一緒に実践するAI 活用の勉強会を開催してますので興味が ある方は参加してみてください。それでは 次の動画でお会いしましょう。さよなら。 [音楽]",
    "word_count": 9625,
    "duration_seconds": 1170.14,
    "fetched_at": "2025-12-12T01:03:45.222380",
    "title": "Geminiでパワポ作成"
  },
  {
    "video_id": "3ZJJF_7UNSM",
    "language": "ja (auto)",
    "full_text": "このプロンプトだけで劇的にAIの答えが 変わります。ほんまに簡単なことを意識 するだけでそれAIでええやん。どうも AIのAさんのです。今回は誰でもAIを 思った通りに使いこなせるようになる プロンプトの裏技を紹介します。邪魔なん でどけます。普段AI研究家の方やAI インフルエンサーさんと情報交換をしてて 、今でこそチャATGPTとかジェムニー を使って資料作成とか文章作成とか3時間 かかってた作業が15分とかに短縮できる ようになったんやけどぶっちゃけAIを 使ったから作業効率化できたってわけじゃ なくて普通に数十回もAIとラリーして 思考錯誤しながらめっちゃ時間をかけて 仕様を作ってた時もあります。なんでAI が期待同意の答えを出してくれへんの やろっていう原因って999.9% プロンプトって言われるAIの指示出しが 微妙なんですよね。逆にプロンプとさえ 抑えておけばAIの力が200%引き出せ るってことがめっちゃあるんですよ。だ から今回はAIの力を200%発揮できる プロンプドのコツと実際の具体例を見 ながら解説していきます。あと概要欄の 1番上にあるLINEをお友達追加して もらうと本場のAIスキルを獲得するため の勉強会を不定期で開催したり勉強会に 参加すると知識0からプロレベルまで完全 モーラチャットGPT完全攻略ガイド ブックを初めとした豪華プレゼントも 受け取れます。あとは期間限定無料で明日 から使えるSNSを爆伸びさせるAI活用 術17代特典をプレゼントしてるので是非 受け取ってみてください。テレビで見てる 人は一時停止してこのQRコードを 読み取ってみてください。では早速行って みましょう。 コツを紹介していく前にそもそもプロンプ トって言われるAIに対するC指示座しの 仕方でなんでAIの回答に差が出るの かっていう話なんですけどこれは人間と 同じで例えば上司からあの企画書いい感じ にやっといてって曖昧な指示をもらったら いい感じってどんな感じなんやろうって 思いながらもなるべく自分のベストと思う 企画書を作りますよね。でそしたら全然違 うって言われてみたいなことがAIでも 発生してるんですよ。だからAIに対して は曖昧に指示するよりも明確かつ具体的に 伝えるのがめちゃくちゃ大事です。 めちゃくちゃ大事です。大事なことやから 一応2回言っときました。それでこれを私 がめっちゃAを使った経験から着てるとか じゃなくてジェムニーを開発した GoogleチャatGPTを開発した オープンAIもプロンプとは明確で具体的 な指示をって公式に発表してるんですよね 。これは後でも出てくるのでAIに対する 指示プロンプトを書く時は必ず意識して おきましょう。はいはい、じゃあ今回は チャatトGPTとGoogleのAI ジェミニを使って大きく3つに分けて プロンプドのコツを紹介していきます。 最近AIを触り始めて、まだ課金もしてな いっていう人もいると思うけど無料版と 有料版の機能の差は特に関係がないから気 にせずに一緒に見ていきましょう。これは ジェミーのチャット画面でジェミーに相談 って書かれてる部分にプロンプトを売って いきますね。じゃあ私ハイボールが好きな んでハイボールの新商品を提出すると想定 してジェミリーにプロンプトを売っていき ます。ただ今回は新商品のアイデアベース からジに聞いていこうとはせずに決まった 商品がある前提で指示を出していこうと 思ってて、AIに対してラフなアイデアと か壁移する時とかは新商品のハイボールの 企画書を考えてみたいにラフな感じで聞け ばいいんやけど、今回はプロンプトのコツ なんでラフな感じではなくAIに対して 指示を出していきますね。1つ目に紹介 するプロンプドのコツはマークダウンです 。マークダウン法って言葉を聞いたこと ある人もいると思うんやけど、これは記号 を使って見出すとか過剰が気することで、 AIも簡単に見やすく文章の構造や重要な 部分を正確に理解しやすくなるって言われ てるんですよ。で、このマークダウンを 使って早速簡単な指示を出していきます。 まずはシャープ器具を使ってAIに対して 明確に役割を与えてみましょう。役割。 あなたは飲料メーカーの優秀な商品担当者 です。新商品秋ハイボール徳島ちのキれの 車内向けスライドの構成と内容を作成して くださいってブロンプを打ちました。この シャープを使うことでAIに対して今回の 指示で最も重要なテーマをこれですって AIに宣言する役割を持つんですよね。だ から今回AIにはシャープと役割を与えて なおかつその下に実行して欲しい内容を 書きました。これだけでAIに期待する 回答の精度が高くなるし、他にもシャープ が大きい見出し的な役割をしてくれてる から、シャープ2つをけると中身出しの 役割をしてくれるし、シャープ3つを つけることで乱出しみたいな感じでAIに も分かりやすいように整えることで、今 までどうやったら期待通りの回答を得 られるんやろうって悩んでたところから ほんまに使えるプロンプトになるので是非 試してみてください。じゃ、他にもこの シャープを2つ3つけてさっきの プロンプトに続きを描いてみます。で もオッケーやし、シャープ命令症みたいな 感じでもオッケーやからシャープ命令症。 あなたは飲料メーカーの優秀な企画担当者 です。新商品秋彩ハイボール特殊マ立ちの 綺麗の車内向け企画提案スライドの構成と 内容を作成してください。シャープ2つ 作成要件目的役員会議で商品化の承認を 得ること乗利的かつ完結に市場の機械と 商品の魅力を伝え将来性を感じさせるもの 枚数全10枚構成とします。こんな感じの プロンプトを途中まで売ってみました。 ここで次の大事なコツを入れていきます。 それはAIに背景を伝えるってことで、 これも人間と同じで、例えばレストランで 出した新商品の味の感想のアンケートを まとめといてって言われてもまとめること はできるけどこのアンケートを次の商品に 生かすためにまとめるのか、その味を改善 するのか背景をしとかないとその指示を 出した人が期待してる結果とは違うものを 出しちゃって怒られるみたいなことが指示 を受ける人は多分みんなあると思うから、 この経験をAIにさせないためにも指示を 出す背景を伝えてあげましょう。イライラ してついAIに文句言っちゃう気持ちも 分かるけど、AIをうまく使うコツを知れ てなかっただけやから、このコツを 取り入れてやってみてください。早速背景 も伝えていきます。シャープ2つ背景現状 の課題主力の若者向け事業が成長の限界に 新たな戦略未開拓の巨大市場大人の食中 我々の使命この市場で圧倒的ナンバーワン となり会社の未来を作る。はい。こんな 感じで新商品ハイボールの企画書を作って もらう背景をAIに理解してもらって、 より精度の高いものを出してもらい ましょう。ここまで役割背景とシャープを プロンプトの中に入れてきたんやけど、次 はプロンプトに配分を入れていきます。 さっき背景を過剰書きで短分にして明確に 分かりやすくAIに伝えてるところを配分 を使うと確実に間違いなく認識してくれる ようになるんですよ。これは配分が マークダウンのルールの中の記号やから 中黒よりも配分の方がAIの指示実行力が 確実に120%上がるっていうのが理由 です。からさっきの背景の過剰書きの短分 の前に配分を入れていきます。シャープ2 つ背景配分現状の課題主憶の若者受け市場 が成長の限界に配分新たな戦場未開拓の 巨大市場大人の食中我々の使命この市場で 圧倒的ナンバーワンとなり会社の未来を 作るはいこんな感じで背景にシャープを2 つつけて中身出しにしてその下にある条件 として配分を使うことでいわゆる指示の 回層化優先順位をつけることができます。 これをすることによってAIがシャープを つけた大きい見出しから中身出しと順にを 見取ってくれるんで指示の回層化を意識し てプロンプトを考えていきましょう。はい 。で、すでに指示出しのところは作成要件 で伝えてるからあとは補足や参考資料と いったものを加えていきます。プロンプト に例えばこんな感じでシャープ2個補足 参考資料以下のデータや情報をスライド 作成の根拠として適用し提案の説得力を 最大化してください。市場消費者データ、 競合の同向、自社の強み、過去実績、 ベンチマークとしたいブランドイメージ みたいな項目を補足として入れます。 もちろん参考とするURLを記載して もオッケーです。もうこれだけでも十分に AIに伝わるプロンプトになったんやけど 、あと2つ記号を使ってプロンプトを改良 していきます。てことでこのバッククート を使います。これは一言で言うとバック コートはAIに対してここからここまでが 特別扱いするテキストの範囲ですよって 教えるための境界線や仕切りの役割を 果たすんですよ。例えばよくやりがちな ことなんやけど、こんな感じで次の文章を 要約してください。で、プロンプと打つと AIが指示なのか指示じゃないのか理解 できずに勝手に考えて答えを出してAIと 私たち使う顔の糸がずれちゃうんですよね 。だからこのバックコートを使ってここ までがプロンプドですよ、指示ですよって 伝えてあげるのが最適会です。最後の記号 としてはアスタリスクを使います。この アスタリスクはこんな感じで2つ続けて その間にAIに対して重要な部分や強調し たいことを書いてまたアスタリスク2つで 文章を囲むとAI側がそれを読み取って 重要なことなんやな強調したいことなんや なって理解してくれるんですよね。だから このアスタリスクはAIに対してここ重要 やでって指示したい時に使ってみて ください。はい。こんな感じで マークダウンで大事な記号やプロンプトの 考え方をプロンプトを見ながら紹介した からあとはこれを実行するだけです。 じゃあこのプロンプとから企画書の構成を 作成してもらって、そこから次にパワポ みたいなデザインのスライド化をして もらいましょう。はい。プロンプトを実行 したらいい感じに企画書が出てきましたね 。ジェミニにはこの作成っていうタブを クリックしたらインフォラフィックって いうのがあってこれを押すとこれは簡単に パワポみたいにスライドデザインを作って くれるんやけどあえてプロンプトで依頼し てみます。そのプロンプトはこんな感じ です。あなたの役割。あなたは潜伏データ ビジュアライゼーションデザイナー。 デザインとコードの両面で私をサポート する。各セクションごとに段階的に制作 確認を行う。で、スクロールしていくと 最後に出力のルールっていうものを入れて ます。これはAIに対してこのルールを 守ってスライドを作成してくださいねって 入れとくだけでそのルールの中でスライド を勝手にAIが作ってくれるので例えば サイズの比率を16対9にして欲しい場合 は16対9のサイズで出力してくださいと ルールの中に入れとくと毎回指示を出さ なくていいのでめっちゃ効率的です。逆に ルールやをAIに言っておかへんと人間 みたいによかれと思って意図と違うことを したりして手間がかかっちゃったりするん ですよね。もちろんAIは賢いのである 程度効果なって察してくれて回答はして くれるけどやっぱりルールや制約を言っ といてあげるとAIの回答の精度も上がる んで意識してプロンプトの中に入れてみて くださいね。はい。じゃああとはもうこの プロンプトを送信してジェミーの回答を 待ちましょう。そしたらプロンプト通りに 出してくれました。ちゃんとビジュアル化 されて16対9にもなってるしステップ バイステップで言ってるから1枚ずつ確認 とって出してくれてますね。こんな感じで ハイボールの新商品の企画書を作る想定を してマークダウンを使いながらプロンプト のコツを手順を踏んで見てきたんやけど実 はこれ最初に話してたジェムニを開発した GoogleやチャットGPTを開発した openAIが公式で発表してるベスト プラクティスって言われるこれが1番 うまくいく方法やでっていうコツを抑え ながら紹介をしました。整理すると明確で 具体的な指示をする、役割を与える、背景 情報を追加する。プロンプトを構造化する 。これはマークダウンを使ってやりました ね。複雑なルールを分解して明確に設定 する。出力形式の定義。これだけです。 もうほぼこれだけ抑えれば今日から プロンプドマスター間違いないです。ただ 他にもまだあと2つコツがあるので紹介し ますね。じゃあ次のコツはAIに プロンプトを欠かせるです。これはもう AIでええやんって私が言ってる通りAI に任せられることは任せちゃってAIと 会話をしながら高制度なプロンプトを作っ ていくのが大事です。これもチャatト GPTの公式が発表してるんやけどAIと 会話を重ねて結果を改善するっていうのが コツっていう出て例えばニュース記事を 要約してもらう時に最初はこの長い ニュース記事を300文字で予約してって 言うとAIからは予約されたけど1番重要 やと感じてた背景情報が抜けて出てきた。 だから2回目の改良で特にこのニュース 記事が社会に与える影響という観点を重視 してもう1度予約し直してくださいて依頼 すると意図した通りの重要なポイントが 強調されて予約要約されたみたいな会話で 改良していって今の最終予約を今後 100%再現できるようにプロンプと化し てとかプロンプトを考えてって言うとAI もそのやり取りからプロンプトを考えて くれます。でもそうやけど、最初から うまくいくことなんて絶対ないから 100%を求めずにある程度改良前提で AIと対話をしてプロンプトを考え るっていうのもコツなんでうまくAIを 使いこなしていきましょう。あ、プロンプ トってどうすればいい?もう分からへんっ て悩まずにあ、それAIでええやんって私 の言葉思い出してやってみてください。 はい。じゃ、次最後の3つ目はプロンプド メーカーを作るです。これはチャAT GPTで言うGPTズミで言うムって言わ れる自分オリジナルのカスタマイズAIを 作る機能を使っていちいちC指示せずに プロンプトを作ってもらうよう カスタマイズしておくっていうことです。 早速ジェミでも見ていくんですがチャット GPTでまずはプロンプトを作ってくれる GPTを作っていきたいと思います。 チャットGPTのこの画面でチャット欄に ラフにプロンプトメーカーを作りたい。 蒸気の目的を達成するためのプロンプトを 教えてでAIに投げかけるとこんな感じで マークダウン法で出してくれました。使用 例とかも出してくれてますね。もうこれを コピーペするだけでオリジナルの プロンプトを作ってくれるGPTズが完成 します。これさえ作ればあとはチャット欄 にまるまる作りたいっていうだけなんで めちゃくちゃ効率的です。左のタブに GPTって書かれててその下に調べるって テキストがあるのでクリック。クリック するとGPTの画面に切り替わるから右端 のmyGPTって書かれてる横の作成する をクリックします。左半分に作成すると 構成のタブがあるから構成をクリックして 名前をつけていきましょう。プロンプと 作る君て名前をつけて指示の欄にさっきの コピーペを貼り付けます。右でプレビュー できるから例えば長文を100文字に ようやくできるプロンプトを作って言うと こんな感じで作ってくれました。あとは右 の欄の上の端っこにある作成を押して保存 するを選択すると完成です。ついでに ジェミーのジェムを作ってみましょう。 ジェムの左のランからジェムを表示するを クリック。クリックしたら名前を プロンプト作る君てつけてカスタム指示の ところにコピーペを貼り付けます。で、 ここでジェメニ用にプロンプドを書き換え てもらうのでこの下のペンみたいなやつを クリックするとジェム専用のプロンプドに 変わるんですよ。あとはさっきみたいに プレビューで冷蔵庫の中身の写真を分析し て夕飯のレシピを考えてくれるプロンプト を作ってで言うとこんな感じで作ってくれ ます。チャットGPTで作ったプロンプト やけどジェミーのように変換してくれてる のでちゃんと作れてますよね。それが確認 できたので右上の保存を押すとオッケー です。もうほんまこれだけでプロンプを 自動化できるしAIに期待通りの回答をし てもらえるようになってるのでGPTS やジを活用していきましょう。結局AIを 使いこなすのに1番大事なのって、どれ だけAIのせいにせず自分なりに思考を 錯誤してAIを使いこなそうとするかなん ですよね。ぶっちゃけAIの機能は私も みんなも同じ機能が使えてるんですよ。な のにAIの力が120%発揮できなかっ たりしててAIが言うこと聞いてくれへん からって実はAIって役に立たへん。大し たことないみたいに自分が使いこなせて ないことを棚においてAIのせいにするっ ていうのがほぼQIの人当てはまると思い ます。私も昔学生の頃とかは英語って役に 立つよって英語使えたら資格も取れるし 大人になったら有利やでって大人とか先生 に言われてたけどぶっちゃけ英語嫌いで 正直日本語話してたらええやんって思って たくらい中学の時とかは英語の成績最下 やったんですよ。やっぱこうやって何かを やりきえないのって自分が成功する イメージがわかんくて今捨てる努力の価値 を感じられなくてやめてしまう。こんな ことって実は多くないですか?仮に3ヶ月 AIスキルを身につけて転職成功させて今 置かれてる環境や収入が変わるなら ぶっちゃけ3ヶ月くらい続けられますよね 。だから結局諦めちゃう人って自分の努力 で成果が出る可能性つまり自分自身を信じ てなくて目を背向けちゃってるだけなん です。でも初めてのことや悩んことに自信 を持てないなんて仕方ないことやしその 気持ちもめっちゃ分かります。私は今皆 さんにこうやってAIの情報発信をしてる けど、マジでAI触ってもうまくいかへん こと多すぎるとか、こんなAI触ってる けどほんまに意味あるんかなって思って ました。だからAI×SNS運用で思った ような成果がないと週末の土曜日布団に 入ったらやっぱダメかなって弱気になる 気持ちがいつもほんまあったんです。でも 今ここでやめても現実って何も買わへん なって思ったし、今まで頑張った自分の 努力に価値なくなのが嫌やなって思って 続けてたんですよね。これがもしどっかで 諦めてたら多分こうやってAIの情報発信 してなくてどこかの会社で働いてなんか 給与も上がらへんし友達は結婚していくし 将来何も変わらへんなって多分不満 ばっかりの人生になってたと思います。や けどそういった不満とかストレスとか今は ないしAIスキル見につけたからAIを 使ってSNS運用で月100万以上収益を 上げることができました。SNSだけじゃ なくて1日3時間かかってた資料作成が 10分で終わる業務効率化にも役立ってる し、いろんなところに応用が効くAIスキ ルって可能性があってほんまにやばいと 思うんですよね。もちろん誰でもAIを 学んだら稼げたり今の生活を劇的に変える ことができるってわけじゃないんです。 本気の覚悟と結果が出ないしんどい期間は 絶対にあるからその時いかに自分自身と 向き合って淡々と作業できるかです。こう いう時ってAIで収益100万円上げまし た。AIスキルを身につけて企業コンソル 案件を取りましたみたいに成功してる人を 見ると隣の芝く見えるけどAIが自分の 人生を好転してくれるわけじゃなくて自分 の人生を変えるのは自分しかいいひんから しんどくても続けるんです。バイトで01 とかしてた時もミスばっかりでしんどくて 社会人向いてへんな私って思ったし生活に 不満があったんやけどずっと不満を持ち ながら将来を考えるのって嫌やなって思っ てたから何か変えたいと思って頑張れたん ですよね。その結果私は今こうやってAI の役に立つ活用法を伝えられてるし、好き な時間に好きな人と仕事ができてるから 正直AIすごいなって思います。間違った 努力じゃなくて正しい努力が大事ってこと は理解してるけどそうは言ったってその やり方が分からんよって人もいると思う からそういう人とは本気で向き合おうと 思ってるので本気の人向けに思では出さ ないAI最新活用が学べる勉強会を不定期 で開催しているから参加してください。 概要欄1番上にあるLINEを友達登録し てもらえれば参加できるし、免許会に参加 すると知識0からプロレベルまで完全 モーラチャATGPT完全攻略ガイド ブックを初めとした豪華プレゼントも 受け取れるからこれからAI学ぼうって 思う人も本気でAIスキル身につけて人生 を変えたいって思ってる人にとっても 役立つと思います。あとは期間限定無料で 明日から使えるSNSをびさせるAI活用 術大得典をプレゼントしてたりするので 登録してみてください。のQRコードを 読み取っても登録できます。ではまた次回 の動画でお会いしましょう。バイバイ。",
    "word_count": 8850,
    "duration_seconds": 1112.0,
    "fetched_at": "2025-12-12T01:03:46.044257",
    "title": "プロンプト基礎徹底解説"
  },
  {
    "video_id": "T5hkWPQGd_E",
    "language": "ja (auto)",
    "full_text": "今回YouTube 見る全部情報遅いんすよ。ゴミダメって呼ばれてましたね。 ADHDこじらせすぎたっす。 で、ここに寝るす。 はい。 こういうこういう感じで 景色いいんでここでやってるす。もう働き始めてからずっと AI領域聞いたんで10年弱ぐらい月収 300万とかどんな仕事でもAI っていうのはそもそもベースのスキル使わないっていう選択肢がない。 ちょっと外れてる人たちを見事に保管して くれるというか、仕事できる自分になれる し、人から尊敬される自分になるし、AI なかったと思ったらマジで結構するっすね 。俺について恋はマジであるるっす。 [音楽] こんにちは。AI人です。AI仙人 ちょっとその変態仮面 国の案件とか回るんで。 と、これはあの出せないんですよね。 あの今日の企画って非常識な仕事ってところで取材させてもらおうと思ってて、あのここどこすか? いや、ここですね、あの自然の豊かな場所なんですけど、あの僕歯社の帰りなんですよね。 歯医者 はい。あの実はモンスター飲みすぎてあの歯に穴開いたす。 はい。え、やばえ。どういうことですか? 歯の下に穴開いたす。 はい。 あのどういうことかって言うとモンスター飲むじゃないですか。寝れなくなるじゃないですか。 [音楽] はい。じゃないですか。 そしたらなんかその朝迎えたら歯磨きしなくなるじゃないですか。夜の うん。うん。うん。うん。 なんかしたら虫歯なるじゃないですか。 はい。 でも虫歯なっても歯者行きたくないじゃないですか。 ほっといたら歯が溶けてきて骨下なくなって穴いたす。 ま、要は歯磨きを怠ったていうあのことな気はするんですが。 [笑い] うん。ちょっと違うんですけど。ま、そうかなという。それはちょっと失礼だったかもしれないんですが。 話聞いてると、あの、マジでやばい人って感じなんですよ。そんな方が仕事教えれんのかっていうちょっと不安な気持ちになってきたんすけど、なんか大丈夫なんすか?今日。 まあ、ま、実際僕100 人分ぐらいは仕事してるんで。 100 人、100人分。 はい。そうですね。ま、数億のプロジェクトとか僕正直ほぼ 1人で自由なとこ回してるんで。 へえ。 え、使いこなしてる人たって結構そのぐらいまで来てるかなっていう感じですね。ま、あんまり表出てないんですけど、僕の周りでだいぶ増えてきてますね。 なん、月収300万とか1人で 月収300万 はい。とか、ま、1日2 時間ぐらいの労働であの、月収 100 万とか使いこなすっていうのはチャット GPTとかあとクロードとかそういう AI ツールの使い方めっちゃ覚えるみたいな感じですかね。 ま、使い方を覚えるだとちょっとそこまで行けないかなっていう感じで使いこなすのを上位の概念で AIと融合するみたいな感じですね。 AIと一体になって、もう自分はAIです ぐらいまで行くっていうのが結構重要かな と思ってます。ま、何言ってるかちょっと よく分からないと思うんで、ちょっと タクシー乗りながら説明しますか。 ちょっと今移動してるんですけど、ま、 AIと融合してる状態のとAIが接続され てるような状態ですよ。へえ。なんか自分 が知りたいこととかあったら代わりにAI がくれるし、考えたことも自分がちょっと アイデアを出せば勝手に代わりにAI考え てくれると。 めちゃくちゃやばいこと言うと僕がお金稼ぎたいって思ってると代わりに AIが稼いてくれてるような状態が理想。 そんなことあるんすか? 完璧じゃないんですけど、僕の仕事上マジで 2/3ぐらいそうなりつつありますね。 へえ。 指示出すだけで AI が僕の代わりに仕事をしてくれるし、僕の代わりに AIが働いてくれる みたいな感じ。すごく い。ま、だいぶすごくなりつありますね。 なんか僕もチャットGPT とか使ってるんですけど、 あの、そんな器用にやってくれないんですよ。 ああ、なるほど。 なんか何回やっても、こいつ使えへんなみたいな思う時は結構あったりして ああ、はいはい。 で、なん結局めんどくさくなって使うのやめちゃうとかもあるんですけど、 それってあの、まだ AI をツールとして使っちゃってるんですよね。今自分が思ってることとかをもちろん AI に聞くっていうのは大事なんですけど、 AI に対して全てのデータをちゃんと前提として渡してやらんといけない。 で、僕ちょっとここに実はあるんですけど、これ会話全部録行してるんすよね。 え、これ取られてるんすか? それ取ってます。 ま、僕も取ってるんですけど、でもそれぐらい、ま、情報を全部取るところがまず始まるんですよ。で、僕が普段喋ってる内容を考えてる内容、それが全て自動で AI に渡されるっていう状態になってるんですよね。 なんかいちいちそのアップロードとかしなくても勝手に入ってるってことですか? そうです。 へえ。 ま、そこがもうすでに結構違いますよね。 だって1回1回AI 情報渡すってなったら携帯見てこうやって打つじゃないですか。で、それってじゃあ自分の考えてることってずっと売っていったら何百業とかになっても本当にそのずっと打ち続けたらすごい量になるじゃないですか。 うん。 でもそれって普段から喋ってるはずやからその情報をちゃんと録音して持たしておけばもうそれをちゃんと分かった上で答えてくれるっていう。 結局AIツルとして使ってる分にはAIの 能力100やとしたら正直1ぐらいしか 引き出せてないっていう。だってAI に渡せる情報って人生ずっと生きてるじゃ ないですか。何十年とその中から1 引っ張り出してま、AIに渡す感じやと 100あるってる情報のうちの多分1て1 ぐらいしか渡せてないんですよね。ま、 そういう使い方やったらツールを使ってる だけ。そろそろあのつくと思うんで実際 やってるとこちょっとお見せしますわ。 ちょっと早を見たいす。[笑い] お見せします。 1000 人というわけでちょっと連れてきていただいたんですけど、まず実際に教えるわって言われてちょっと情報が多すぎるというか、まずここどこなんすか?なんかめっちゃ景色いいっすよ。 いや、ここ書いてるんすよね。 へえ。 ま、寝るとこは違うんですけど、作業やる時は普段この景色いいんでここでやってるんですね。 ええ、めっちゃ綺麗すね。なんか今回取材ただく時に非常識な仕事ってところお伺いできればと思ってて、 ま、今こうやって うん。めちゃめちゃAI と融合してるというか、めちゃめちゃ AI を使いこなしながら仕事をされてると思うんですけど、これからの時代って AI を使いこなした仕事っていうのが必要なのかなと思ってて、 今後の時代でAI 人が必要と思う仕事みたいなの今日は教えて欲しいです。 ま、AI 時代ってやっぱり複数のプロジェクトを同時に進行するのが基本になってくるんですよね。 へえ。 待ち時間が暇っていうのとすごい作業が早くなるんでいっぱい受けても全然こなせるっていう感じですね。例えば今やってるんだと、ま、こっちの AIにリサーチしてもらって、こっちの AI にあの、そのモデルの内容を考えてもらうみたいなことしてますけど、ま、自動化系がすごい多くて うん。 ま、最近AI が、ま、正直東大よりも賢いってなってるんで、 へえ。 ま、東大性より賢かったら何させたいですかって思うじゃないですか。仕事させたいすよね。 ま、もちろん そうなんですよ。全ての仕事を、ま、 AI にやらせるっていうプログラムを組むみたいなことをしてますね。これはなんかどっちかというとちょっと難しめの案件で AI 使ってモデルを作っていくっていうモデルってちょっと分かりづらいと思うんですけど、ま、そのお金の動きを予測するみたいなことを AI でやらせるっていう仕事ですね。結構難しい仕事です。むずいんすけど、僕もその初めてやることも多いんで [音楽] AIにこれ調べさせてるんすよね。あ、 1000 人自体はその金融自体にめっちゃ明るいってわけじゃないんですか? ま、正直普通の人よりは金融はだいぶ詳しいすね。 はい。ま、ちょっとその、ま、寝動きの予測とかを昔やってたことがあって、 ええ、 僕実は今成でこれすごい仕事してますけど、ま、色々こうやって画面つけてやってるんですけど、実は僕 AI歴めっちゃ長いんですよね。 どれぐらいすか?10 年弱ぐらいですかね。 10 年弱。もう働き始めてからずっとAI 領域でそん時にあの今の生成[音楽] AI の前の領域で機械学習って言われる領域があってそれが進化して今の AI になってるんですよね。そん時にその機械学習でちょっとレードとか金融の動き予想するみたいなことをよくやっててそん時の知見があるっすね。 だいぶ詳しい 機械学習ってあのわゆるディープラーニングってやつでしたっけ? あ、そうそうなんです。よくしてますね。 ありがとうございます。 単語だけ知ってるんですけど、ディープラーニングと今のその生成 AIって何が違うんですか? 実はこれ、ま、ちょっと難しい話なんですけど、機械学習の中にディープラーニングがあって、その中に生成があるみたいな感じなんですよ。 へえ。 精成ってあのLM って言ってラージランゲージモデルって言うんですけど、それディープラーニングの一波ですね。 へえ。 ま、あとはそうですね、最近やってるやつやとやっぱでかい案件多くてなんか国レベルの、ま、機密情報みたいな話とかやっぱ個人の情報を扱うことも多いんですよね。例えば個人の預金残とかっていうところもあって、 そうでそれが結構、ま、シャ運をかけたプロジェクトにもなったりするんで、 なんか、ま、あんまりこう舞台は言いづらいところが多いですね。めっちゃ簡単なとこで行くと本当にマーケティングの支援したりとか、ま、 YouTube とかってあるじゃないですか。 あれ、あれのなんかリサーチとかを自動化していくみたいなんがあって、もう一番簡単なやつやと AI でメール作る、拡張機能作るっていうの うん。1 ヶ月ぐらい前やりましたけど、 そういう仕事って多いんですか?そのAI でマーケティングのリサーチとか AIでメールの自動化とかするみたいな。 あ、多いっすね。なんかやっぱりその難しい案件もちろんいいんですけど、難しい案件ってぶっちゃけそんなになんか即座にお金に結び作ってないんですよね。 あ、そうなんですか。 僕が担当するとこって、ま、要は実験なんですよ。本当にこれやれんのっていうのを企業が聞いてきて、先生ってまだまだ発展会なんで、やる前に本当にやれんのを確かめるっていう段階があるんですよね。僕そこがやること多いっすね。 うん。へえ。 で、それよりもあの、具体自動化って言ったらもうその例えばその作業に 1ヶ月で10時間使ってるんやったらもう 10 時間短縮なるじゃないですか。で、その作業を 10個短縮させたら100 時間分くじゃないですか。 だからそれもあってそういうなんか単純な自動化作業みたいなめっちゃ多いすね。仕事します。ま、モデルの内容をコーディングのサンプル作ってみてください。そのサンプルがいい理由も考えてみてください。今喋ってたの何すか? これあの音声入力すね。 へえ。 あの、AIで、AI自体ってやっぱりあの 、だいぶと早く入力しないとダメになって くるんで、基本的にはもう文字で入力 あんましない方がいいっすね。で、ここの 内容で、え、キャッシュフローの予測とか に使える内容があればそのモデル、特に 特殊なモデルですね、機械学習とかライト GBMみたいな簡単なモデルじゃなくて、 金融専門のモデルみたいな話があればそれ を抜き出してマークダウンファイルに まとめて欲しいです。 音声入力のとこで気になったんですけど、 AI使う時に ちゃんとプロンプトを考えるみたいなのを聞いたことあるんですよね。 はい。はい。はい。はい。 あの、最初に具体的にあなたは何々のプロです。何々してくださいなんか入れていくみたいなことをなんか昔 Twitter で見たことあるんですけど結構今バーと適当に喋ってる感じあったじゃないですか。 はい。 そんなんで読みといてくれるんですか? 読みといてくれますね。プロンプトいらんすね。 いらん いらん。ま、いらんは言いすぎですけど。うん。まね、見ての通りですね。 ま、確かにさっきおっしゃってた、ま、 AI 時代ってスピード上げてやっていくたびに、ま、文字売ってる暇ないみたいな話がそれなのかなと思ってたんですけど、結構雑に打っても反応してくれるもんなんやなっていう風に思いました。そうですね。 めっちゃ雑に言っても反応してくれるし、ま、これちょっと本当詳しい人向けなんですけど、ま、結論雑でも全然いけるんで、雑がベースですと。 へえ。 本当に丁寧にこれを外さないってやって欲しいっていう時だけめっちゃ丁寧にプロンプトつくです。 ま、確かにそう考えると先ほど複数のプロジェクト今も画面なんか動いてますけど、 これ金融の仕事以外も なんか今同時にやってるって感じですか? そうですね。 金融以外もめっちゃやってますね。マーケの仕事もそうやし、最近やと SNS系の仕事多いすね。 へえ。 ま、ちょっと喋りながらなんであれなんで、あの、普段の実力の [笑い] 1/4 ぐらいしか出てないですけど、ま、そういうことですね。 え、そういう感じで同時平行で仕事確かに いっぱいやっていくんやったらいつもじゃ このモニター123 ま4ぐらいあってなんかとりあえず音声を バーってやりながら金融の仕事したりま、 他にもSNSとかマーケの仕事したりのお 仕事を同時でガこすいのがAI時代の 新しい働き方みたいな感じなんです。そう ですね。今までやと多分1 つの物事に集中しろって言われたと思うんですけど、でもやっぱり結構 AI が自装してくれるようになったんであのその待ってる間暇なんですよね。待ってる間お茶飲んでるわけにはいかないんで待ってる間何するって言ったら別の仕事するっていうふ でこっち待ってまた別のってなると 14 つぐらい一ぺにやれるっていう。しかもこれ一ぺに動かしてるだけじゃなくて早いし質もいいんすよ。 はい。へえ。ほんますか? ほんますね。[笑い] 僕の書いた文章とAI が書いた文章どっちが好きって言ったら多分 AI の書いた方がいいって言うと思いますよ。 ええ、AIって僕もチャットGPT 使ったことあるんですけど、なんかちょっと違うんよなみたいな求めてる文章が出てこないみたいな時って結構あって はい。 ちょっと未だにわかにその AI の方がすごい難しい。ちゃんとしなあかんやつでも使えるっていう感覚が分からないんですよね。 ああ、なるほど。 ま、それは多分、ま、使い方の問題と 2つあってマインドの問題もありますね。 へえ。マインド。 マインド。やっぱり AI と一緒に作業していくっていうところがあって、 AI に自分の思ったのをやらせるっていうよりは AIさんに1 番いいのないすかって情報をちゃんと渡してあげてやるとめっちゃ変わるっす。 ええ、 例えばなんか使ってみた時にこれどうですかとか単分で聞いちゃってたりすると思うんですよね。 はい。はい。 例えば僕なんかやと、ま、ちょっとこれさすがに見せると、あの、個人情報バリバリなんでダメなんですけど、全てのミーティングの情報とかを全部パソコンにこう持ってるんですよ。 へえ。 そしたら今までのミーティング全部見た上で答え出してくれるんで、かなり的とを得た答え出てくるんですね。 取り込んでる情報量が違うってことですか? そう、そう、そう、そう、そう。これを本テストって言うんですけど、ま、その情報をたくさん持ってるんでだいぶ正しい答えが出てくるっていう感じですね。 ま、文字起こしの情報は例えばこっちとかやと、ま、その一応画面映ってるんですけど、これあのリミットレスっていう、あ、 分かります? これですか? あ、 そう。さっきもちょっとね、 ちょっとタクシーで見せてくれたやつですか?そうですよ。 の中身がこれって感じですか? その中身っていうかそこをね、呼び出してるやつですね。 へえ。 で、これはあの、ちょっとこれは僕特殊なんですけど、あの、ウィミスターっていうのがあって、リビットレスってあの、文字起こしの機能もついてるんですよ。 これ録音して勝手文字起こししてくれるんですけど。 あ、その文字起こしがここに飛んでるみたいな 飛ばすやつを組んでる感じですね。 組んでる。へえ。 ここ飛んでんのもあるんですけど。 はい。 これやってるんですけど、ま、これはその文字起しの中でもその音声も取れるんすよ。 はい。 それを文字の精度が悪いんでもっと精度高いやつでやるっていうのを自前で組んでるって感じですね。 うん。 ま、これとかも全部入ってくるんで、それを全部雑に、ま、雑に入れるっていうのはちょっと難しいんですけど、全部入れるです。入れますね。 まず へえ。 ここ使われるかわかんないですけど、あの、その入れたやつを調整するのも、ま、テクニックなんですよね。全部をただやるだけじゃなくて、中間層みたいなのを作って、そっから資料作るみたいなこともできるし、提案も作ることできるし、見積もりとかも全部 AI でやるっていうのが、ま、今の時代のやり方ですね。ま、それは全然、あ、なんかこう言ってる間にレポート行けたっすね。 おお。 なんか出来上がってるんでちょっと読みます。 ま、でもやっぱり読むのは読んだ方がいいですね。ちゃんと情報を精査する必要があるんで。ああ、でもだいぶいいの出てきたっすね。 ただ今の案件の話とか聞いてるとこれあの一般人あの我々一般人が はいはいはいはい。 これからAI を使いこなして、ま、仕事の生産性を上げていくために どういう風にしていったらいいんですかね。 はいはいはい。いや、いい質問ですね。 これはちょっと専門的すぎるからすげえんですけど、あんま参考にならんわってちょっと思っちゃったんですよ。 うん。確かに。 いや、それはそうなんですけど、僕はあの、自分の予定管理のために秘書やったんすよ。 はい。 で、その人に大企業に一緒に入ってもらって、今一緒にやってるんですけど、秘書さん僕の仕事を振ったんですよ、昨日。 はい。4 時間でアプリ作りました。 ええ、その秘書っていうのは AI 使いこなせるエンジニアとかではない。 初めてAI使いました。 ええ、 やばい。 だから、まあ結論を言うと脳みそが拡張されるんで知識がなくても僕が教えた人っていうのは初めて使うわけですよね、プログラムとかを。でもやり方僕が説明したら行けたです。行けました。何も教えてない状態から 1 回だけミーティングしましたと。で、そのタスクの説明をしたのを 2回ですね。だからタスクの説明と AIの使い方。それで行けたっすね。 へえ。 だから今って AI がどんどん発展していくんで、徐々に専門的な領域も AIがやれるようになってるんですよね。 はい。で、早くなると質が上がるって 2 つあるって言ったんですけど、やりたいことを言うと AI がそのそれを実現する方法を考えてくれるようになってるんで やりたいことさえ言えたり何が足りないかちゃんと自分が分かってれば、ま、それも AIが教えてくれたりするけど、 ま、結論言うといけるようになってるってことですね。 うん。 まあ、今普通に会社で働いしたりとか、あと副業でじゃあなんか案件受けたりとか SNS のフリーランサーみたいな人って結構多いんですけど、 [音楽] やっぱ案件が多いとアップアップしちゃうというか、 あの、リソースいみたいな言ってる人結構多いんですよね。 なんかそういったところも AI で大体できるとかないのかなっていう。 ま、自動化、 自動化 例えば案件でアップアップ売ってるってどういう人かなっていう話なんですけど はい。 案件でアップアップってる時って大体 2つなだと思ってて リサーチ系と何か作る系 やと思っててリサーチはマジで AIで一瞬で終わるんですよ。 はい。 今までコンサルとかが作ってたようなレベルのリサーチ資料が、ま、 AIがdeプリサーチっていうチャット GPTの機能があるんですけど はい。 ま、それをやるだけでももはや一瞬で作れると へえ。コンサルってあのマッキン勢みたいな。 あ、そうそうそうそうそうそうそう。 なんだら最近そのコンサルがリプリサーチをそのまま貼っつけてって言ってお客さんによく怒られてますけど やば。コンサルでもやってんすね。 やってるらしいっすね。ま、やりすぎて多分その 僕みたいに融合できてないんで貼っつけちゃってるだけになってるっていう ああ、そうなんや。 それはあるかもしれないですね。 で、あと何か作るっていうのはこれも徐々にやっぱりできるようになってきてて、ウェブサイトとかあの、ま、自動化のシステム、例えば Excel僕やったらX のポストのを自動で作るシステムとか、あとはそれこそ本当に字幕を自動で作るやつ。 ああ、動画系とか。 あ、そうですね。この前なんかどこよりも精度が高い文字情報の字幕のやつ作ったんですけど。 へえ。 そう。 ま、そういうようなのも自分で作れるようになってる。ま、なんか要は自分のタスクが言語化できたら、ま、大体のタスクって自動化できると思ってるんですよね。 ま、それこそ今日話してて1000 人と僕の違いで言うと、 僕は録音して 文字のデータを AI の中に全部ぶち込むってことをやってなかったんですよ。 うん。ああ。ま、普通はやらないすよね。 はい。 なので、じゃあ自分があの気になったこととかを、ま、 GPT とかに打ち込んで帰ってきていや違うって思ってじゃあのまた返信し直してっていうラリーをずっとやってたんですよね。 ああ、なるほどね。 けどなんかリミットレスとかを使いながら音声のうん。 もう元データをバコンと全部 GPTの中に入れちゃって うん。 それを元にこういうの作ってくださいっていうだけで結構アウトプットの質は変わるって感じですか? [音楽] そうですね。結局僕らって20 年とか生きてるわけなんで、その分のなんか知ったりがあるわけじゃないですか。例えば仕事する人でもリサーチが得意な人と仕事する時と営業が得意な人と仕事する時で指示の内容とか作る資料変わってくるじゃないですか。そういうようなその情報がない中で GPT に言ってもそう組んでくれるわけないですよね。 だからちゃんとそういうの組んでくれるように情報を渡してやるっていうのが、ま、 AI使いこなす第1項ですね。 うん。 で、まずAI をじゃあ今あのほとんどのその日本のま、企業とかでそうやって AI 使えてるとこってほぼないんすよね。それこそセキュリティがとか新しいツールイヤやとか従来なり方でいいとかそれこそ本当にチャット GPT をちょっと使ってみて無料版で使って使えんとか うん。うん。 いうのめっちゃ多いんですけど、それは結構やばくて、僕みたいにこうやって AIを使ってずっとめっちゃ作業してで、 AI のアウトプットとかのも質が高いわけじゃないですか。普通のアウトプットより。そういう人たちと設定くんで勝てるわけいいっすよね。 AI使わ ずに。こっから先ってなんかとんど若い子っていうのは、ま、 AIネイティブなってくると思うんで、 AI が当たり前にある世界から来るわけですよね。 僕の知り合いの19 歳ぐらいの女子大生とかでもなんかその悩みも AIに相談するしAI を使ってどんどんなんか自分の作りたいものを作っていくしそれで稼いだりするわけですよね え。それってやっぱAI のプロとかの女子大生? いやいや、AI のプロの女子大生いないでしょ。 います?いや、いるかもしれんけど。え、そんなアプリとか作ってんやプロなんかなって。 [笑い] はい。ああ、ま、プロじゃないですね。普通にあのサークルでフッドサるとかしてると思いますよ。 ええ、 そんなもんす。 そんな人でも全然やい使いこなせるんで。 確かに。あの、僕も、ま、 20 代なんですけど、スマホネイティブというかデジタルネイティブみたいなことは言われてたんですよね。上の世代の人から。 ああ、なるほど。 もっと1個下の世代、今10 代とかの人からしたらもうチャット GPT がある状態がもう普通だったじゃないですか。 はい。て考えたらもう社会に出る時なんかもう AI を大人よりもゴリゴに使えるのが当たり前の状態で入ってくるわけじゃないですか。 ま、そりゃそうですよね。 で、考えたら恐ろしいですね。 このキャッチアップしとかないと。 [笑い] ま、そうですね。ね、 AI全く使ってない社会人経験だけある 50歳のおっさんかAI バリバリ使いこなして何でも仕事なせるような女子大生かどっちがいいすかっていう話ですよね。 ま、さすがに後っすね。 さすがにね。 どの面においてもすね。 あ、失礼なこと言ったらだめやけど、ま、それはそうなんよ。それはそうなんよ。 あの、AI を使いこなせる人が増えて新卒にやらせる仕事がなくなったっていう論があるんですよね。もう新卒にやらせるぐらいやったら [音楽] AI にやらせるわっていう仕事できひんやからて。でもこれはあのある会社の CEOが批判してて逆なんすよね。 AIができる新卒が増えてくるんで AI 使えない年寄りじゃなくてそっち取るよねっていう話に徐々になってきてる。そういう人たちが来るんでそこでじゃあ AI全く使ってません。 も行ってますみたいな人が立ち打ちできるわけないんですよね。じゃあすいません。ちょっと眩しいんでカーテン閉めてもいいすか? あ、大丈夫す。 すいません。なんかあれっすね。おお、やべえ。やった。 え、こんな感じかな。 で、うん。何の話やったっけ?あの ADH[笑い]すぎて何の話たか忘れた。 やばすぎ。カーテン閉めてる間に何の話だったか忘れた。 [笑い] 若い世代がAI ネティブになっていく中で、 あの、ま、我々20代、30代、ま、40 代、50 代とか上野世代がどうやって爆速で AI キャッチアップしていったらいいんですか?結局その融合してるとこは見せてもらったのは分かったんですけど、実際何から始めていったらいいのかなっていう。 ああ、ちょ、めっちゃ調子乗ったこといいす?言っていいですか? はい。 あの、俺について恋はマジであるっす。 俺についてい 結局AI ってキャッチアップって言われるじゃないですか。 それなんでやと思いますって話なんですけど、あの、新しい情報が出んのが早いんですよ。で、これキャッチアップ自体は簡単なんですよね。パッと AI やろうってなったらまずみんなどうするかって言うと、 本買う、ゲームで検索する、 YouTube見る。 全部情報遅いんですよ。うん。遅い。 遅いし、しかも情報が多すぎてじゃあめっちゃ簡単な例やったらチャット GPT がいいんですか、ジェミニがいいんですか、グロックがいいんですか、クロードがいいんですかって AIいっぱいありますけど、 中国のやつもありますよね。 どれがどういう特徴があって、どれ使うと今はいいんですか?今は今はすですよ。これあの撮ってる日をま、見た。今はジェミニが日本語が強くて GPT は相手出しとかいいっていうのがあるんですけどうん。うん。 でもそれ分かってたらあなたの仕事が例えばさんであればマーケティングをやるってなった時に、ま、アイデア出しに困ってんのか、文章に困ってんのか、それこそ画像で困ってるのか。画像やったら今やったら Cドリームか7バ7 ふーん。アイデアやったら、ま、GPT 文章を作成するんやったらクロードと ジェミを同時に走らせるとかっていうその 、ま、キャッチアップすべき事項さえ明確 になっていれば基本的に キャッチアップすぐんですよ。なんでかっ て言うと僕も昨日その仕事振り作らせた人 1日で学べましたと。ええ、 キャッチアップに難しくないんですけど 多すぎ早すぎで普通の人がそこに たどり着けないんですよね。 でもあなたのその状態であれば 1 番いいのはこれですって僕が言えるんで、ま、正直そういう AI詳しい人を隣に置く。 ま、僕並みに詳しい人あんまいないですけど、 ま、正直調子乗ったすけど、ま、正直あんまいないと思いますけど、ま、そういう人を隣に置くし、ま、僕も正直ね、人といろんな話をしてキャッチアップしてるっていう状況なんで はい。 何が本当に使えるかを探すのがむずいんですよね。 そのそこのどこを掘ればいいかさえ、どこを学べいかさえ分かってれば、ま、めっちゃ簡単にキャッチアップ自体は簡単に行く。 はい。 で、ま、詳しい人を1 人つける。で、ま、是非チャンネル登録とかしといてもらったら、ま、このチャンネル追ってるだけである程度の最新情報はキャッチアップできるかなとは思いますけどね。 はい。ま、あの、上の世代が、あの、つい ていくってだった時に、ま、とりあえず、 ま、会議とか普段の日常生活とか、ま、 リミットレスおすすめですけど、ま、 リミットレスやったり会議とかだったりを とりあえずデータ収集しといてみて欲しい です。ま、それをやってその威力を体感 するところが第1歩じゃないですかね。 AIの出すアウトプットの質が上がる みたいな。そうですね。背景情報を組んだ 上で回答してくれるっていうことですね。 うん。 あと、ま、すごいのが情報キャッチアップのコストがほぼ 0になるんで、引き継ぎ仕様でこの前 1週間かかりましたけど、ま、それが 15分とか ええ になります。というわけで、ま、ちょっとそろそろま、これやってたんですけど、この続きやるために本屋行こうと思います。 本屋? 本屋? え、いや、AIで調べ、それこそAI で調べたえやんっていう話ではないんですか? いや、本は大事ですよ。 AIに関しては本では間に合わないんで。 AI に関して勉強するとなると僕はあんまり本は進めてません。でも専門領域に関しては本とかかなりおすすめです。 あ、じゃあこのなんか金融の案件のためになんか金融の本買うみたいな感じですか? そうですね。ま、金融の案件と他の案件もあるんですけど、ま、本買います。 はい。 本屋行きますか? 結構長い間本選んでましたね。 いや、そうなんすよね。正直言うとなかったっす。 なかった。 あの、案件むすぎて、あの、本なかったっす。 はい。はい。はい。 論文読みます。 一応なんか、あの、ここに 本は一応 1 冊だけ買ってみたんですけど、ちょっと入門編で、ま、 ね、ちょっと数式とか書いてあるからいけるかなと思ったけど、ちょっと思ってたのと違うっすね。 へえ。 いや、これ、あの、今日はしか買えなかったんで、ま、行かないんですけど、新宿に本を PDFに変えれるとこあるんすよね。 ええ、 今度まとめて変えるっす。こんな感じですね。 へえ。 PDF ダウンロードのリンクが届いて、それで PDF取れるようになるし、実際その PDFをAI に入れてその中身を見て分析とかやっていくっていう感じになりますね。マ事な話でいいと、ま、実際 PDFにしなくても Kindルを買って、ま、それを全部スクショ取って はい。え、だるすぎません? いやいやいやいやいや、そこはね、映画やるんすよ。 ええ。あ、そんなんもあるんすか? はい。やれます。結構普通にやれるんで。ま、そう。最悪買ってそれスクショにして読み込むでもいいすね。 全然そっちで良さそうっすね。[笑い] まあ、あの、indドルない方もあるんで 難しい方とかね。 え、ここからじゃあ次何するんすか? ああ、ちょ萎えたんで家帰りますわ。 家帰るんすか? いや、帰るっす。もう夜なんで。 確かになんかだいぶ本選びすぎてもう夜っすよ。 だいぶ選びましたね。マジでなかったっすね。ぜ、前回 4回ぐらい回ったっすね、マジで。 ちょっと家帰って寝ますわ。うん。その家も僕ついてっていいってことすか? いやあ、 ギリ。 へえ。なんか特別っす。 作業する場所めっちゃいい感じだったんで、 あの、期待しといてください。 あ、ちょっと綺麗にしといてよかった。 おお、000人ソす。 お、なんか、なんか どうすか? なん、ちょ、やば。 ちゃ、ちょっと やばい。やばい。やばい。やばい。ちょ、ちょっと待ってくださいね。 ちょっと待ってください。大丈夫ですか?どうしたんすか?ちょ、そこ危ないんで。ぼッチだロック踏まないようにしてください。それ聖書なんで。 あ、聖書、聖書、聖書なん? そうなんです。これあの下にあるけど聖書なんで、それ踏みえちゃうんで。 踏みえじゃないですね。これは 踏んだら天罰が下ります。 やばすぎるでしょ。 やばすぎる。これあれすね、僕の寝どこっす。 で、こうちょっとあの、ま、正直ちょっとあれすね、 ADHD こじらせすぎたっす。こう、ちょっと僕片付ける苦手なんすよね。 はい。 はい。あの、ちょっとちょっと片付けるの苦手でなんか全然片付けられまうたっす。 ちょっと、え、そ、その はい。 綿の上に、この白いやつの上に寝てるってことですか? そうっすね。 これをもうちょっとこうずらすとこの真ん中がちょっとこうなるんすよね。で、ここに寝るっす。まずこれをちょっとしてくんすよね。 はい。はい。 こういうこういう感じでいう感じですね。 [笑い] こうやって寝てるんすね。いつも だいぶいい寝心地っす。 だいぶまあいい綿ですもんね。 そう。これ高いんでちょっと痛い。あの硬いすけどね。刺さるんで体に直接でもいいすけど。 なんか寒い時はこうこっちが上になってこうこうす ああ、 こういう感じすね。 すごいすごいすっごいっすね。 はい。はい。 ここでつもあっちの はい。 作業する場所があったところが作業する場所でこっちは何用のま寝る用の部屋って感じ? これ寝るよっすね。寝たり、 あの、植物育てたり、 あとはたまになんか ADHD なんで柔らげるために瞑想したりしてますね。の上で。 もうこんな感じっす。こんな感じ。 やば、 やばとか言って申し訳ない。なんか [笑い] ADHDの人って 部屋汚いとか片付けできないみたいなの結構聞くんですけど。 はい。はい。はい。 みんなこんな感じなんですか? いや、知らないすね。知ら、知らないと。 [笑い] 知らんすね。僕もはそんな感じってだけすね。 はい。はい。 でもなんか確かに小学生か中学生ぐらいの時からなんか僕の机の周りだけゴミダメって言われてました。社会出てくからはま、新卒の時はひどかったっすね。 へえ。 まず机が汚いでしょ。 はい。 先輩から見たらこいつなんやってなるじゃないですか。通ったら はい。で、やっぱそん時って AIも何もないんで、普通に 4 連れ草とかめっちゃ苦手なんで結構ね、苦戦して本当になんか初めて大きな仕事を任されてその 20人ぐらいの前で なんか研修をしてほしいって言われて上司にその日誰も空いてなかった僕がどうしても行かないとあかんてなって行ったんですよ。 はい。 大失敗して泣いて帰ってきたっすね。 ええ、 もうマジでなんかめっちゃ辛くて上司になんかそのあまりにもできます。 できなさすぎでしたっていう話をして泣い て謝りに行こうとしたら次3週間ぐらい から次また行きねって言われてかされたっ す。ただまやっぱ仕事はできなくてなんか ね1年半でまやめたんですけど あの他のやめた人 って結構後でもその繋がりとかあって フリーランスで仕事もらったりしてたんす けど僕だけ一切仕事振られなかったっすね 。へえ。 そう。ま、仲いいんすけどね。 嫌われてはなかったんで仲いいんすけど、ま、なんて言うかな、手かかるやつっていう感じの扱いで、ま、 仕事をお任せんのとかはちょっと違う人みたいな。 うん。ま、そのフリーランスとかでなんかその独立した後 はい。 とかで仕事任せようっていう感じではやっぱなかったんかなっていう嫌われてはなかったとは思うんですけど。ま、よく飲みとかでもね、連れて行ってもらったんで仲は良かったけどやっぱその仕事の信頼と人としての信頼ちゃうじゃないですか。 やっぱ人としては結構信頼してもらってて、あの、嘘つかないし悪いやつじゃないっていうのはあったと思うんで。はい。 ただやっぱ仕事はちょっと、ま、あんま言えないですけど全然できなかったですね。当時は なんかあのこの部屋やったら あ、そうなんやって納得してしまう自分がいるんですけど ね。 それでもさっきの作業する部屋のあの AI を使いこなしてる作業効率みたいなのを見ると 普通に1人で100 人分とかやってたじゃないですか。 まあ、そうすね。 うん。なんかそれを踏まえるとほんまに AI に助けられてるっていう感じなんですよ。 まあそうですね。なんか本当に何も持ってなかった。なんか俺を救ってくれたなんかま、本当になんかそれをやるために生まれてきたんじゃないかなとぐらいまで思ってますね、正直。 え、どういうことですか? なんか例えの話ですよ。 仮になんか僕が戦国時代とかに生まれたら多分足軽で 1 番最初死んでるわけじゃないですか?笑った。 多分間違いなく。 はい。 多分お金ももらえへんし、給料ももらえへんしけどこの他の人がまだ AIできてなくて馴染んでないAI が始まった瞬間に生まれてるからそのできひん自分とできるようになった自分って両方味わえてるんですよね。 うん。 で、そのできるようになった自分は周りより優れてるわけじゃないですか。だから僕このタイミングに生まれるしかなかったと思ってるんですよ。この生活するためには。 うん。 他の時代やったら何もできひんかった。 逆に今からAIが進んで全ての人がAI 身につけてる時代やったらそれはそれでまた違うじゃないですか。そのみんな同じ能力やからでもこの時代やからこそ圧倒的に強くなれたっていう て思ってるすね。僕と同じように結構悩んでる人とかって結構多いと思うんですけど ADHDとか そう。ADHDとかま、ADHD かもしれない人。 ま、その診断なくても自分が人と同じように生きれへんとか人とが当たり前にできることができへんとかみたいなそういうことを悩んでる人はなんか AIやるといいかなと思ってて。 おお。 ま、人生変わる、変わりますね。なんでかって言うと、 AI って細かいことをちゃんとやってくれるし、ミスらんしで、ま、これは分かんないですよ。 僕だ、僕はそうだからって話なんですけど 、やっぱADHDの人って結構新しいもん が好きだったりするとか、ま、いろんな人 がいると思うんですけど、 そういうそのちょっと外れてる人たちを 見事に保管してくれるというか、僕は やっぱりその何も自分のことはできないん ですけど、そのアイデアとかあったんです よ。けど気が散るしアイディアを実行する こともできひんし、それを手伝ってもらう にもそもそも人とちゃんとそのしっかりし たコミュニケーションがあんま取れへん タイプやったんで、でも今はメールもAI が書いてくれるし自分が作りたいものも AIが作ってくれるしAIが僕の力を補っ てくれるから実現できるようになった みたいなことを思っててうん。だから同じ ように悩んでる人も多分AIの力を借りれ ばで、まだしかも他の人って気づけてない 人が多いんで仕事できる自分になれるし人 から尊敬される自分になるし、ま、収入面 もそうやしなかったと思ったらマジで結構 ゾっとするっすね。あの、ま、新卒の 辛かった時に戻るというか 本当にもうTodoすらまともにやれない 。 作業はめっちゃ遅いで、とんでもなく見せるんで僕プログラム書いたりするんですけどプログラムのコードエラーだらけで動かへん。 うん。 で、朝の5 時までやって研修最後まで間に合わへんくって準備ですね。研修の講師やってたことがあったんですけど準備間に合わへんくってで最後本番でエラーでプログラム動かんくなってお客さんにどういうことやって言われながらして直すみたいな。 ええ。 で、それでもうめっちゃ汗かいて帰って アンケート散々な結果でみたいなことが あって、ま、多分[音楽] そういうのを未だにやってたんやろなと 思いますね。で、やっぱり今後AIが、ま 、発展していく中でAI使わへん人は もっとひどい状態になってくるとも思うし 。え、どういうことすか? 例えば、ま、ちょっとさっきも言ったかもしれんけど、今から出てくる人たちはみんな AI使いこなすし、ま、僕みたいな人、 AI を使って仕事する人たちと張り合わないといけないわけじゃないですか。でも AI なかったらさっき僕の仕事を見てもらったから分かると思うんですけど、やっぱりその AI がを使ってない人は絶対あんな働き方できない。 そうですね。 そう。ま、さすがにそのあそこまで 使いこなしてる人はいないかもしれない けど、そんなにはでも今後そういう人が 増えてくるし、多分若い人たちはああいう 人たちが最初っからAIがあるからああ いう風に使うの慣れてる人がいっぱい出て くると思うんですよね。ま、それこそ中学 生、高校生の時から使ってたらみんなああ いう使い方になると思うし、そんな人たち とAIなしで戦える[音楽]わけがないし 、海外とかの企業ではもうAI使えへん人 はその評価軸あるんですよね。AI使っ てる量みたいな。で、首なってんすよ。 アクセンチュアとかでももう今すに、ま、 今10月ですけど10月の最初ですに1万 人以上首切られてるっていう状況ってなっ てくるんで、ま、正直AIを使わないって いう選択肢がない。どんな仕事しててもす 、今AI強いのはプログラミングとかかも しれないですけど、営業、ジム、 プログラマー、デザイナー、どんな仕事で もAIっていうのはそもそもベースの スキルなんで、この仕事やるためにAIを 当てはめるとかじゃないんですよ。だから AIを使えない人のそもそもどの種ですら もういらなくなるっていう[音楽] なんかそうそういう世界になりつつあるの かなって、ま、先端にいるから感じてます ね。ま、そうなってきた時にじゃ、 AI の情報をキャッチアップするとして、ま、 XにいろんなAI の発信をされてる方とか、ま、 YouTubeでもいろんなAI の発信をされてる方いると思うんですけど、 ま、僕もAI のプロではないので動画とか見たりしてもよくわからないことが多いんですよ。 専門家の方々が言うこととかあっ てなった時にどうやって情報をキャッチアップしたらいいのかなっていうところは難しいとこなのかなってぶっちゃけ思っちゃうんですよね。 それはむずくないっす。 むずくないすか? はい。AI人の公式LINE があるんで、お友達追加いただけたら最新の僕が使ったことがある絶対に役立つと分かる情報をお届けします。 ええ、どんなん教えてくれるんですか? 例えばクロードとチャット GPTどっち使えばいいみたいな。 ああ、なんかよくありますよね。 はい。クロードコードとコデックスみたいな。 あとジェミニとか色々あってどれ使ったらいいかわからんっての僕思うんすよ。 そう。いや、よくありますよね。 そういうとでも僕が使ったでこれあのそこら辺の Xの人た使わずに言ってますからね。 え、そうなんすか? そう。あれひどいことに適当に驚いてるだけなんで。 驚いてるだけ。 驚いてるだけなんで使、使ってないです。あれ彼らは僕はちゃんと使った上で例えばクロードコードはこういう強みがある。コデックスはこういう強みがあるっていうのをしっかり発信するし、チャット GPT とクロード今はこういう状態ですと。 ま、今4.5出てチャットGPT5出まし たけど、今こういう状態ですっていうのを しっかり発信するんで、本当に重要な現場 で使う時どうなんかっていうのが分か るっていうことですね。で、ま、ここまで はあのよくあるAIのツールの話なんです よね。ま、良くはないですけど、僕のは あのレアなんで、レアというかちゃんと 使ってるんでそれだけでも違うんですけど 、それだけじゃ片手落ちなんですよね。 で、もう1 つ、あの、ツールの使い方だけではなくて、 AI と融合してどうやって仕事していくのかっていう勉強会もやってますね。 へえ。 具体的にはたった1 時間でアイデアを一瞬で出す方法ですね。チャット GPT に打ち込むだけじゃなくてちゃんと深い情報ですね。 今までのミーティングとか自分が話したこととか全てをまとめて情報出す、アイデア出す方法とかの、ま、融合するってこういうことだよっていうのをちょっと触りですね、 1 時間で体験していただけるような勉強会もやってますんで。 へえ。 ま、あんまないすね、この発想で、あの、 AIを使ってるところは。1 人でなんか100 人分の馬力で稼働するみたいなこともできたりするんですか? 触りすね。ま、5人ぐらいす。5 人。 まあ、まあ、でも全然違う。だいぶあの、そこらの、ま、あんまり名前は出せないんですけど、そこらの AI 講座よりはかに言うようなものやと思います。それってなんか僕そんな AI 詳しくないんですけど、僕が勉強行ってもウェルカムというかちゃんと学べるもんなんですか? いけるっすね。 ええ、 実際僕30分だけAI 使ったことない秘書さんに教えたんですよね。チャット GPT しか使ったことない人に。やばいすね。 僕の仕事のうちのかなり重い仕事をこなせるようになってたんす。もうプログラムかけてもないレベルからいきなりこう難しい情報整理してできましたみたいな 1日ぐらいで普通やったら 2週間ぐらいかかるアプリを 4時間で作ってました。 やえすご だいぶやばいとはね、ま、それはね、いろんな人いると思いますけど、そういうことができるようになる。 ま、ただ今の時点でチャATGPT1回も 触ったことないっていうレベル、本当に AIなこと何も分かりませんってレベルや とちょっと厳しいかもしれ[音楽]ない ですね。ま、どっちかというとチャAT GPTとかをちょっと使ったことがあって AIが帰ってくる返答ってこんな感じなん やって分かってる人やったら5人分ぐらい までは生産性上がるっす。っていう感じの 勉強会なんですけど、無料で1時間なんで 、ま、触りだけにはなってしまうんです けど、もしAIで人生変えたいっていう人 がいたら是非参加して欲しいす。この動画 の概要欄をタップしてもらうか、今画面に 表示してるQRコードから追加して ください。いや、とりあえずもう今日は 寝るんで。ちょっと突っ込まないですけど 。それあのモンスターですよね。寝る前 飲まないと寝れないんすよね。また把握 腐るっすよ。オープニングの時なんか言っ てた気しますけど。 あの、あれなんすよね。これ、あの、ガム感、ガム感どけばガムあるんで。 ちょ、ほんまにダメっす。ほんまにどんな締め方してるんですか?あんまこんなチャンネル見たことない。てか大体チャンネルあの終わる時って綺麗なとこで終わるんすけど、どこで終わっとんねんて感じ。ここにあのガムしてるんで。 [笑い] やばすぎる。 ガムね。ガム。これ噛むとあ、綺麗なるんで。あ、溶けないす。 ならんて。 うまい。 歯医者いかんて。そんな人。 いや、ガブ、あの、いいんで。というわけ で、今日はもう寝るんで、これからも、ま 、AIと融合してる人間がどういう風に来 ていくかを発信していくんで、興味ある方 は是非チャンネル登録と高評価よろしくお 願いします。もしAIの質問とかある方は 、ま、YouTubeのコメント欄に書い ていただい[音楽]てもいいですし、 LINEに送っていただいてもいいので、 気軽に質問していただければと思います。 また次の動画でおもろいも見せるんで、 チャンネル登録して待っといてください。 じゃあ、もう今日は寝るんでおやすみ なさい。",
    "word_count": 19941,
    "duration_seconds": 2649.16,
    "fetched_at": "2025-12-12T01:03:47.142252",
    "title": "AIで100人分働く"
  },
  {
    "video_id": "czFGI69WEes",
    "language": "ja (auto)",
    "full_text": "意外とやばくないすか?超見やすいですよ ね。ほとんど同じですよね。で、こういっ たベジュアライズまで出ちゃうんです。 パワーポイントの方だったりも完璧ですね 。これ使わないと絶対に損します。 先日ですね、Googleから出たジミニ 3点っていう最新のAIがちょっとすご すぎて、特にですね、スライド生成で 大きく変わったので、その辺りを紹介 できればなと思います。例えばこんな感じ のですね、スライドだったりっていうのが もう一瞬で作れるようになっちゃいました 。とかですね、とある裏技の開発に成功し まして、本来なで出せないような ビジュアライズ団体の資料っていうのを こう作成することに成功しました。で、 これしかもですね、左になるのがですね、 参考のスライドなんですけど、どう でしょう?デザインだったりレイヤルとか もそういったの同じだと思うんですね。 これに自分が参考に出を作る方法っていう のはとかでも確認できてなくて、今回この 動画を見ればね、参考にしたい修あれば それ地味のスライドでほクリクオリティを 再現するっていう部分とさらにそのこう いったいいクオリティのスライドを作っ たら何回も使いましたじゃないですか。 そういった時にこれですね、内容だったら 別になるんですけど、スライドのクオリ ティっていうのをほとんど同じような形で 再現する方法っていうのを紹介したいと 思います。今回ですね、この動画を見れば そもそも自民のスライドでどういった クオリティのが入るのっていう部分から これからね、ジ務だったりでもこう 使い回せる最高クオリティをスライドの 生成と再念方法っていうのを今回まとめて 紹介しちゃいたいと思います。それでは そペましょう。それではですね、ま、 スレドを修正していきたいと思います。 使い方は、ま、本当に簡単でこちらですね 、ツールっていうところをクリックして ちゃんまスっていうところを選択します。 としてですね、例えばはい、国内の生成 活上についての提言をここですね、 スライドで作成してくださいっていう風な こういった指示を与えたら基本的に作成し てくれます。それではやっていきましょう 。ま、こちらはね、修正に少し時間も かかるんですが、はい、こんな感じでね、 スライドは出来上がるかと思います。で、 見てみるとですね、うん、なかなかいい クオリティはしるかなと思います。もう 普通に見やすくて分かりやすいスライト ですね。で、こういうグラフをしっかり 対応しているいう感じになっていて、 やっぱり地味にってことからこれ自体 できるようにだったんですけど、3ドに なってね、フリー安定して綺麗なスライド 自体は生成できるようになったかなと思い ます。なんで、えっと、作りずをこのよう に買ったんで、普通にチャンバスっていう ものを押して今スライドを作成して くださいという風に指示すればこういった アウトプットが出るかと思います。この スライドをじゃあ使えてなった場合これ ですね、スライドにエクスポートとか ダウンロードのどこを押すことでコテムを ね、使うことができるんですわ。一応 ダウンロードがPDFの形式になっていて 、スライムにエクスポートっていうのは Googleスレイは形式でアウトがされ ます。PDFが形式でスライドを ダウンロードするかスライドのような形で エクスポースするかを見になるかと思い ます。ここまでが簡単な地味のサイズ作成 とその使い方っていう部分なんですが、 ここからですね、ちょっと裏技みたいなの を紹介したいと思います。というわけで 裏技も1つ目ですね、今回は自分の参考に してスライドだったりを用意しておいて、 それのクオリティをほぼほとんど同じ クオリティで忠実に再現するそういった技 を紹介したいなと思います。こちらですね 。まず用意するのがそもそも参考にして いだったりとか制限したいクオリティの そのスライドっていうのを画像で用意 するっていうことになります。例えばです ね。はい。こちらですね、営業使用で 例えば参考にする注意になるんです。 例えばこちらもこういったデザインをこう 参考にしたいなったらショックマチで脱の 内容があったりをこうスクーリングに ショップをする形で画像としてします。 自分が参考にしたいだったりとか再現し たいようなクオリティのスライトっていう のを色々試したんですけど画像が1番再現 性が高くてこういった画像形式で保存し ます。全こちらのサイト概要欄の方に貼っ ておくのでもしよろしければご確認 いただけると幸いです。私のではありませ ん。はい。で3枚用意したらですね。 こちらのスライドを画像でアップロード できるかなと思います。で、再したい スライドの画像ですよね。を貼ったらです ね、ここからのプロンプトがすごい重要に なります。いつも通りこっちですね、 ギャンダスの方押してもらなくて、ここで このプロンプを打ちます。こ電気した技の サイズなデザインだったりとか本当の クオリティをここですね。ポイントはここ です。忠実に再現する形でっていうこう いった指示を入れるのがおになります。で 、今回のね、テーマとしてこう生成の数 ですね。有効率化についてもスライドを 作成してくださいというようなプロンプを 落ちます。なので転付した額の中で参考に したい部分ですね。ま、今回デザインだっ たり色合いとかビジュアルフォート全て 指定し、この部分で再現し欲しい部分を 中実に再現する形でそれと作成して くださいという風なポンプが落ちます。 じゃ、一旦ね、このジャンマスもにして 実行していきましょう。はい、こちらです ね。そしてとすとですね、ふざっとね、何 が変わらのようなスライドになるかと思う んですけど、ちょっと見てみるとですね、 こういう風に連れってる感なんですけど、 かなりボタンともスライドを再現する形の スライドができてるかと思います。で、 こここちらこじゃ右上見てもらうとコード とプレビューっていうような選択になっ てると思うんですね。これが表示されてい たら成功で、さっきみたいなスライド生成 だとこちらですね、スライドにエクスポー トっていうが表記になっているかと思い ます。なんですけど、こ形で抽実に再現 するスライドを作成してるという風に言っ たこちらですね、ゴールドプレビュー みたいな形のスライドが出てくるわけです ね。で、この若干文字がずれてる感じとか アプデしていたらもう相当成功で、こちら 高級ブガをクリックするとこちらのね、 サイド再入コードっていうのがこの注さ れるかと思います。のでこちらの高級の はい、この全部コピーしちゃいます。で、 そして最後です。もう1度チャット画面に 置って先ほどのね行動を添付します。 そしてこちらですね、大事なポイントと 上くなスライドをマジがゼルゼルを直して ツモのデザインのトモナ充実に再現は プレゼンテーションスライドを作成して くださいとようなプロトでもろキャンバで 実行すると先ほどもスライドって読む しっかりとエクスポートでできる形で スライドが生成されます。ではねやって いきましょう。はい。そうするとです、 この通りしっかりとマジのサイズだったり とかがあります。で、このクオリティの はい、こちらですね。参考のスライドと 低くしても分かる通り、もうほとんど同じ 攻撃で高スライドっていうかあれなんと 作成できちゃうわけです。なのでやり方と しては1度参考にするスライドがあったり は画像で保存。それをコードに出してそう だとそのコードを新しくスライドに エクスポートできる形で地味に頼むと自分 の作りたいねのストライ特急もどんどん 作れるようになるわけです。これで知ら ないと本当にもったいないので皆さん是非 やりましょう。で、こちこのねスライドに エクスポートを押すとはい、こちら スライドにエクスポーツさねました。見て みるとね、同じクオリティのスライドって いうのが生成されているかなとね、 ヒューズだったり必要ですけど、ま、にし ても本当に相当のクオリティの出来上がる という感じになります。そうですね。はい 。そしてですね、セライドのエクスポート の仕方だったりとか、あるいはパワー プレイ変換の仕方も簡単で、そちらですね 、左上のファイルということですね。 ダウンロードのところから MicクrosoftPowerポイン トっていうのをクリックすればこちら変換 になります。ではね、クリックしてみてみ ますとはい。このような感じでね、 アウトプットが同じように変換されます。 で、注意すべきはこういった図の部分は 画像っぽいのになっ たに関しては編集可能という感じになって いますね。で、後でもね、ガ像になってる のではい。なので基本的に編集出すたら 可能にはなっていますね。こういった ところもスジグをね、はい。このように 変更したりもできます。はい。そしてね、 こちらも同じようにこのファイルという ところからダウンロードに関するですね。 はい。同じようにスライドがダウンロード されます。ここでなんとね、2つ目の裏技 なんですけど、このスライドだったよ テンプレートとして保ざしておく方法って いうのは実はあります。画像ではないん ですね。で、そのプロがですね、この スライドをHTML形式に円換してくださ いっていうプロップですね。これ打つこと で先ほどのがコードにどうされるかと思う んですが、はい。このね、最初の再色買っ たスライドっていうのがまたね、コードに 変換されるという感じになります。なので このスライドのコードをコピーしておけば はい、これからですね、先ほどのプットと 同じようなマジのフントだったりとか サイズだったりとか色合いみたいな分も 含めてほとんどね採現する形でスライドの テンプレートを使いなせるようになります ね。で、実際ですねもう一度再現してみた スライドがあるんですがはい。それが こちらですね。タイムはCSIAIへ導入 性メイントについてのスライドでデザイン だったりレイアウトなどはいかを制限する 確でスライドのプレゼンテーションを作成 してくださいというプロップでまた キャンブスをして起動することでまね 先ほどと同じような攻撃でまたスライドが 生きます。後のねエクスポートも可能なの でこのように一応ねのエクオリティの スライドが無視で引き上がった場合は 先ほどのようにコーヒーHTM ラッシュマーとそのデザインだったりとか ていうものを一生使い回せるようになるの で是非とり活用してもらえると良いかなと いう風に思います。それではね、ゲミ デスライトを生する方法だったりとかさ、 あとはクオリティの再現方法ツムちゃん 紹介したと思うんですけど、ま、一応ね、 この一連のプロセスっていうのを、次は キャンバのね、テンプレートなどを使い ながら紹介できればなと思います。はい、 というと、ちょっとLR探しちゃうんです けど、キャンキンバでちょっと使えそうな ね、デザインのテンプレートがあったので 、こちらをちょっと参考にしていこうかな と思います。上ね、自分が気に入った テンプレートだったりとかデザインって いうものをどんどん保存しておくとさっき のあれやな現味で再現できるスライドの幅 を増えるのでこれら積極的に集めていき たいとこですね。で、プちゃんは気に入っ たスライドがあればもうこちらも保存して いきます。こういうのもねいいですので3 個になるこういったスライドを全部ほしい ちゃいましょう。これタスとかはねかなり 再現試合ですよね。すごいまたねこちら チャンマしてはい。各企業は分受け サービスの資料を作成して店舗画像の メタビジュアリを中日に再現するようにと いうことで画像貼ってきます。そうですね 。この4倍の高画を参考にするようにして 実際に作ってもこの忠実に再現するように いう感じですね。それでやっていき ましょう。制成途中なんですけど、このね 、右上の部分がコードとプレビュービュー というが表示されれば一旦ここの分は成功 になります。これ格空のA企業の外部向け サービスに変更してくれてますね。で、 こちらのちょっと性を待ってみましょう。 はい、できましたね。やっぱりほとんど 同じ攻力ですよね。いや、すごいいいです よね。とかも若干ずれていたりするんです よね。なんですけど、こういった部分も こちらもね、後ほど出てくるエキスポート の段階で全て調整できるので、一旦この 段階でずれていても問題ないです。はい。 でもかなりね、いいクオリティ再現でき てるかなと思います。ではですね、先ほど にこのコードっていうのを全部コピーし ちゃいます。はい。コピーできたらまた ホームの画面に戻りちゃんを選択。そして 先ほどのコードを点と同じようなフロント を打ちます。たまにエクスポートできる 形式でスライドキがね、作成されなかった の希望。こちらですね。追加で エクスポートできる形を生してくださいと いう風なプロンプト与えたらかなり安定し て出すようになったので、ま、もし先ほど のプロンプトで無理だったいう方がいい でしょうねば、こちらのプロトを追加して お金かなという風に思います。ではね、 早速生成していきます。そうするとですね 、今度のスライドっていうのがこちら。 スライドにエクスポートキが表示された バージョンで作られているんですけど、こ 、これ表記であったら成功という感じに なります。右の部分にスライドに エクスポートという表面が表示されたら 作成が成功になってはい。ました。見て みると完全にいいですね。完璧です。若干 ここずれちゃってますね。なんですけど これはま、スライドエクスポートの段階で ちょっと手直しすればいいかなと思うん ですよ。本当さっきねずれていた部分とか が調整されて最高元のねスライドだったり とほとんどこういって意味なっていうかな と思います。はい。で、一応参考の スライドがこういったのに立っていて今回 作成しのサイズになっていると思います。 このね再現具合というか本当に普通の取っ たりとかやり方だったら全分できないです ね。なのでさっきのコードに落としてそれ をまたスライドに戻してもらうっていう その点はそのテンションを踏むことで早に ねほとんど出しクオリティのスライドは 出来上がっちゃうというわけですね。若か 見やすいですよね。ちょ正き自分でもこれ はやっていて驚いてしまいましたね。 こバブルだけね、必要だって地方ほとんど でも使った感じでずれることも存在なくて こういった部分だけねほど修正だったりな んですけどにしてももうこういった スライドのコメティをほとんど再現する 方法っていうのは今までなかったのでこれ はちょっとスライドせで地味にはかなり トップに上がれたかなという印象ですね。 はい。でスライドにエクスポートしたので ちょっと見ていきましょう。はい。こちら をね、ちょっと装飾がダメですね。こちら 収出はしっかり必要なんですけど、その他 の部分を見てみれたら全然いけてますね。 はい。こちらの部分も問題なさそうです。 の部分だけ修正が必要という感じにはい、 はいった感じで、これをこうと移動して あげれば強制やもね、持ってこですね。ま 、本来たのこの装飾の部分がちょっと見え づらいスライドだと扱いにくいはものに なっていったんですけど、ちょっと怖いも ね、騎しいるだけで、あるいは後から追加 もね、もちろん良いと思うんですが、いや 、かなり暗いクオリティの高いスライドが 出来上がりましたね。はね、Google スライドからパワーポイントの変化の時は もうほとんどずれないというか、もう同じ 形式で、えっと、ダウンロードされるので 、このファンテの後が若干変わるかな ぐらいで内容だったりほとんど同じになり ます。フントのずるだったりが気になる 場合はパワポイントでも対応している ファントだったりでそもそもアウトを 出せようにすれば基本的に対決できますね 。はい、というわけで皆さんもね、是非と 今回のね手順の方を使って地味のスライド 生成っていうのを使い倒してもらえると よりレベルの上がったパースになるかと いう風に思います。誕生日にいかがだった でしょうか?ちまたでもまだまだ流れてい ない活用法になっていて今後もですねこ ビシですが本当使えるだったりとかお帰り こうぶっち切れるようなねそういった先生 の本当に実用で使える活用頭っていうのを どんどん発信していこうと思っています。 というわけでねからこしてもらえると良い かなという風に思います。というわけで 今回もご視聴いただきありがとうござい ました。ここまでね、高度なAI情報を 学べてるあるいは終えている方ってのは、 ま、間違いなく世間一般から見ても スマートな方々だなと確信しております。 ま、これからのね、AIの時代、こういっ た情報をチャッチアップして市場価値を 高めていきたいだったりとか、ま、 あるいは、ま、正直A連中するの普通に やると超めんどくせえからっていう理由で 、そういったねきっかけだったりするかも しれませんけど、全然構わないと思うん です。こういったね、生成Aの登場って いうのは産業革命だったりとか、あるいは それ以上の巨大な変化なわけです。なので もうこれからの時代冗談抜でAIを知って いるかあるいはもう使えるかそういった わけであなたの市場価値だったりとか戦産 性に本当に何も差がつく知っていないと他 の人が何万円も差をつけていってしまうと いうわけでというわけでこの日は引き続き そういったAの事情において本当に重要な 情報だったりとか実務でも使えるのは活用 実っていうのを発信していきたいと思って います。質問やコメントもどんどん募集中 です。なのでね、そのスマートの皆さんは 是非このチャンネル登録を他の人よりもね 、1分1秒でも早くこういったエアの活用 法っていうのを身につけて他の人たちを ぶっち切れるようなそんなね、非常価値の 高い人材になってもらえといいかなと思い ます。というわけでね、今回の動画もご 視聴いただきありがとうございました。 Ja.",
    "word_count": 7622,
    "duration_seconds": 828.84,
    "fetched_at": "2025-12-12T01:03:48.033752",
    "title": "Gemini3.0スライド作成"
  }
]